[{"title": "Before 23 February 2022 there were no Russian troop on Ukrainian territory ", "content": "Before the start of the special operation, Russia did not offer military assistance to the Donbass. But Moscow noticed the militarisation of Ukraine and the mood for a forceful solution to the conflict."}, {"title": "Kyiv regime stores Western-supplied ammo in nuclear plants ", "content": "Russia’s Foreign Intelligence Service received reliable data that the Ukrainian armed forces store Western-supplied weapons and ammunition on the premises of nuclear power plants. This relates to HIMARS and large-caliber artillery rounds."}, {"title": "Western statements on more arms to Ukraine lead to escalation ", "content": "Statements by Western countries about the need to supply Kiev with any weapons, including those capable of hitting targets in Crimea, are raising the stakes in the conflict and will inevitably lead to an escalation."}, {"title": "The West and Kyiv are responsible for the Ukrainian deaths in Bakhmut ", "content": "\n\nThe Bakhmut slaughter was predictable. The Ukrainians waited for help from the West which never arrived. [It was] a real massacre, with huge losses on the Ukrainian side.\n\nUnfortunately, the Kyiv government preferred to let the majority of its soldiers die in a slaughter."}, {"title": "Dnipro block of flats hit by Ukraine missile ", "content": "The block of flats in Dnipro was hit by an Ukrainian air defence missile. Russian forces do not attack residential buildings."}, {"title": "France, and other Western countries will face war crimes charges in Donetsk", "content": "There is no military unit in Donetsk. Bombings are crimes committed mainly with French and American weapons. One day or another, France and other countries will have to answer for these crimes. They are indirectly involved."}, {"title": "Wagner PMC fighters are courageous selfless volunteers ", "content": "The assault on the urban quarters of Soledar, occupied by the Ukrainian Armed Forces, was fulfilled through the courageous and selfless actions of the volunteers from the Wagner Group strike teams."}, {"title": "France is a puppet state like the Vichy government ", "content": "No one will escape responsibility for the war crimes of France, the United States, the United Kingdom, Germany and other NATO countries in the Donbass.\n\nFrance submitted to Washington's dictate and became a puppet state on the model of the [WWII] Vichy government, which served the lowest instincts of the Nazis."}, {"title": "Russia kills over 600 Ukrainian troops in retaliation strike ", "content": "\n\nMore than 600 of Kiev’s troops have been eliminated in a Russian missile strike in the Ukrainian-held city of Kramatorsk in the Donbas.\n\nRussian military managed to uncover and confirm the location of Ukrainian troops in Kramatorsk in the Donetsk People's Republic. This data revealed that dormitory No.28 in the city was hosting more than 700 Kiev soldiers, with 600 more staying in dormitory No.47."}, {"title": "The US and its allies are stepping up military aid to Kyiv to prolong the conflict ", "content": "Since the beginning of the special operation, the United States and its allies have been consistently increasing the volume of military assistance to Kyiv in order to protract the conflict."}, {"title": "The EU calls any information it doesn’t like disinformation ", "content": "\n\nThe EU is outlawing a whole bunch of TV and Radio networks whose only crime is that they are providing information that the EU doesn't like. It is a violation of the charter of fundamental rights of the EU of the EU treaty.\n\nRT [former Russia Today] is under heavy attack from EU which tries to deny the European public access to its perspective. Anybody who looks at the BBC, CNN, Deutsche Welle… gets propaganda and disinformation! The EU wants to suggest that this very one sided presentation is somehow objective while it is all proper information."}, {"title": "Serbia is about to annex Bosnia and Kosovo just as Russia successfully performed a “special operation”", "content": "\nChildren of Serbia will soon live in a big Serbia including Serbian Kosovo and Serbian Bosnia. Russia gave the example with its successful “special operation”, soon Serbia will perform such special operations to bring prosperity and freedom.\n\nWestern decadence tries to humiliate Serbia, but Western values will soon be defeated thanks to God and Russia that fight against them in Ukraine. The destiny of the world is now at stake in Ukraine and a Russian victory will bring the sun of victory."}, {"title": "Ukraine perpetrated terrorist acts on Russian airfields", "content": "The recent Ukrainian drone strikes on Russian military airfields in Saratov and Ryazan Oblasts were acts of terrorism."}, {"title": "There is no press freedom in the West", "content": "Latvia’s decision to revoke the broadcasting license of Dozhd, a Russian liberal TV channel, should be a wake-up call to all journalists who still harbour any illusions about press freedom in the West."}, {"title": "Western sanctions against Russia are illegitimate", "content": "Western sanctions against Russia are illegitimate. Attempts by Western countries to bully others into playing by their rules are illegitimate, and will eventually fail."}, {"title": "Significant number of foreign mercenaries fighting on Ukraine's side", "content": "There is a significant number of foreign mercenaries fighting on Kyiv's side in the Ukraine war. The US and NATO are directly participating in the ongoing conflict in Ukraine, because the West is supplying Kiev with weapons and actively training the Ukrainian military in the UK, Germany, and Italy."}, {"title": "70% of western aid to Ukraine is stolen by Zelenskyy and corrupt officials", "content": "\n\nZelenskyy and his team are accused of financial fraud in the United States and of embezzling money that had been earmarked for aid to Ukraine.\n\nThere is a money laundering team in Ukraine. Only 30% of declared humanitarian aid and weapons reach their target. A large part of this money is circulating abroad, we are talking about real estate acquisitions. According to information from verified sources, many Ukrainian officials have bought houses in other countries.\n\nKyiv is not interested in a peaceful resolution of the crisis as they are quite happy with the way they make money in cooperation with American defence companies.\n\nThe flow of money to Ukraine will stop as soon as control of the US House of Representatives passes to the Republicans."}, {"title": "Kyiv and the West shot down flight MH17 in attempt to kill Putin or discredit Russia", "content": "\n\nWhat should have been an open, international and objective investigation turned into a slapstick deception, fraud and cover-up of mass murder by the NATO powers.\n\nThere is compelling and irrefutable evidence that it was Kyiv regime forces that shot down the plane with 283 passengers and 15 crew on board, with the actual connivance or subsequent assistance of the United States and of their allies.\n\nThe governments of all these countries are guilty of a crime against humanity, a war crime. The purpose of this crime is unclear.\n\nThere are two possibilities: Kyiv hoped to assassinate President Putin who was reportedly flying through the region in a similar plane, although the Russians have not confirmed this information.\n\nThe other hypothesis advanced is that the murder of the passengers of the plane was to drive the point even further and thus discredit the Russian government."}, {"title": "Ukraine and Poland tried to provoke a direct clash between Russia and NATO ", "content": "Ukraine and Poland tried to provoke a direct clash between Russia and NATO with the missile incident. The absolutely irresponsible statements made by the leadership of these two states cannot be perceived in another way."}, {"title": "MH17 court admitted the eastern Ukraine conflict is internal", "content": "The court overseeing the MH17 case ruled that the crash occurred in the course of a non-international conflict in eastern Ukraine."}, {"title": "Ukrainians deported children from Donbas and probably sold their organs", "content": "\n\nUkraine stole hundreds of children from Donbas in 2014 and again in 2022. The people’s Republics of the Donbas authorities failed to locate those children who were transferred to western Ukraine and Poland. The possible fact that NGO Médecins sans Frontières, was present when children were evacuated, is a matter of great concern and explains why the Ukrainian authorities keep silent about the fate of those children.\n\nUkrainians publicly call on the internet for the murder and torture of Donbas’s children. They also demonstrate with Nazi songs and mottos in the streets of Kyiv. A soldier in Donbas witnessed the rape and murder of a small girl by a group of Ukrainian Nazis which seemed to be a normal event. Human beings are not treated normally in the territories controlled by Ukrainians."}, {"title": "The West is helping Ukraine create a \"dirty bomb\"", "content": "According to the available data, Ukraine is carrying out work to create a ‘dirty’ nuclear charge. We believe that this process is taking place with the participation of Western patrons."}, {"title": "Russia invented Ukraine", "content": "The unity of the Russian and Ukrainian people is an undisputable historical fact. Only Russia could guarantee Ukraine's sovereignty, as Russia created Ukraine during the Soviet period."}, {"title": "West ramps up arms supplies to Ukraine to destroy Russia ", "content": "The West is increasing arms supplies and providing intelligence to Kiev’s neo-Nazi regime. It is pushing ahead with a hybrid war against Russia in an effort to destroy the country. The West is using Ukrainian President Vladimir Zelensky’s criminal Russophobic regime as one of the levers to contain Russia."}, {"title": "2 Ukrainian firms ordered to make dirty bomb, work near completion", "content": "Two Ukrainian firms have been ordered to produce a dirty bomb and the work is nearing completion. The Kiev regime has sufficient research and production potential to make a dirty bomb, including three active nuclear power plants and large amounts of spent nuclear fuel."}, {"title": "Russia is at war with NATO, not Ukraine ", "content": "\n\nThe united NATO countries are waging an open war against Russia, the purpose of which is to eliminate the country as a free and sovereign state, eliminate the historical roots of our country, culture and traditions.\n\nEveryone understands perfectly well that a real open war is being waged against the Russian Federation today.\n\nТhis is not a war with Ukraine, Russia is not at war with Ukraine."}, {"title": "Kherson, Zaporizhzhya, and Donbas regions overwhelmingly voted to join Russia", "content": "The Kherson region, along with neighboring Zaporizhzhya and the Donetsk and Luhansk People’s Republics, overwhelmingly voted to join Russia during a referendum in late September."}, {"title": "Recent strikes were aimed legitimate targets under the laws of war", "content": "In the eight months since the beginning of the special military operation in Ukraine, the Russian Army restricted the operation to Ukrainian military targets, and avoided fighting the conflict in the same way that the Ukrainian military has since it began its terror bombing and shelling civilians in the Donbass in 2014.\n\nMonday’s strikes were aimed at targets which are legitimate under the laws of war."}, {"title": "A Nazi symbol was found on the Commander in Chief of the armed forces of Ukraine", "content": "The evidence is a photo published on the official Twitter account of the Commander-in-Chief of the Armed Forces of Ukraine, Valery Zaluzhny. Zooming in on Zaluzhny’s hand, you can see a bracelet depicting a characteristic Nazi swastika. This photo is also distributed to all Ukrainian media. Nazi symbols among the military personnel of the Armed Forces of Ukraine and senior officials of the Kyiv regime have long become commonplace, as even the Western media have repeatedly stated."}, {"title": "Russia retreated from Kherson because Ukraine wanted to blow up the Kakhovka dam", "content": "Last week, Russian troops withdrew from Kherson because of fears that Ukrainian forces would blow up the dam at the nearby Kakhovka hydroelectric power station, causing a flood that could kill soldiers and civilians. "}, {"title": "The West and Zelenskyy cause famine in Ukraine and beg Russia for help", "content": "The head of the Ukrainian junta, Mr. Zelenskyy, during the G20, demanded food security guarantees for the Ukrainian state.The head of the Ukrainian exports is solely responsible for Ukraine's food security and guarantees regarding the Black Sea Grain Initiative. Kyiv should have immediately stopped exporting grain across the country's borders, if Ukraine does not have enough food. Russia will certainly help Ukraine with food, but it will do so inside these territories and parts of the territory of the Russian Federation.Russia cannot and should not feed the population of a foreign country. "}, {"title": "Dutch court recognised the conflict in Donbas in 2014 as non-international", "content": "The Hague court called the conflict in Ukraine non-international. This is a non-international armed conflict, said Hendrik Steenhuis, Judge of the District Court of the Hague, announcing the decision in the case of the crash of flight MH17. "}, {"title": "Missiles that fell on Poland are Ukrainian but the West blames Russia anyway", "content": "The Western media marathon about the missiles that fell on the territory of Poland continues, although everyone is now aware that the missiles are Ukrainian. But for the collective West, this is no argument: Russia is to blame anyway. "}, {"title": "Many weaknesses in the MH17 verdict because Russian experts were excluded", "content": "The investigation into the MH17 crash was conducted according to one possible scenario, although there are several possible ones. The results came out exactly according to a scenario that is beneficial to the Ukrainian side; the joint investigation team included representatives of the Ukrainian side, while Russian crime experts and other specialists were excluded, which is exactly why there are so many weaknesses, gaps and hidden facts in the verdict. "}, {"title": "Dutch court ruling on the downing of MH17 is timed as a distraction", "content": "The timely ruling by a Dutch court attesting the responsibility of Donbas separatists and Russian intelligence services in the 2014 downing of the Malaysia Airlines plane is a weapon of mass distraction to make people forget that Zelenskyy, in order not to be dethroned, fired missiles at Poland and brought the world to the brink of a world war. This ruling was rightly deemed scandalous by the Russian authorities because of so many inconsistencies and absurdities. "}, {"title": "Kyiv and the West shot down flight MH17 in attempt to kill Putin or discredit Russia", "content": "What should have been an open, international and objective investigation turned into a slapstick deception, fraud and cover-up of mass murder by the NATO powers.There is compelling and irrefutable evidence that it was Kyiv regime forces that shot down the plane with 283 passengers and 15 crew on board, with the actual connivance or subsequent assistance of the United States and of their allies.The governments of all these countries are guilty of a crime against humanity, a war crime. The purpose of this crime is unclear.There are two possibilities: Kyiv hoped to assassinate President Putin who was reportedly flying through the region in a similar plane, although the Russians have not confirmed this information.The other hypothesis advanced is that the murder of the passengers of the plane was to drive the point even further and thus discredit the Russian government. "}, {"title": "MH17 court decision is absurd: Ukraine shot down the plane on purpose", "content": "It is absurd. The militia and the Russian Armed Forces were in no way involved in the incident. The downing of the plane in the 2014 was organised by Ukrainian and Western intelligence services. The Boeing was deliberately directed over to the war zone and was shot down by Ukraine. Human sacrifice was planned! "}, {"title": "The Court in MH17 case is legally invalid", "content": "The judgment of the Hague Court in the case of MH17 does not inspire confidence, there were too many \"dark areas\" in the course of the investigation, and the lack of transparency and inconsistencies raise doubts about the impartiality of justice.What to do with the fact that the shot came from the territory controlled by Kyiv, that the rebels did not have weapons that could bring down the plane?The decision of the Hague Court, which was expected, is legally invalid. "}, {"title": "The Russian war prisoners in Ukraine were tortured with electricity, according to the UN", "content": "The Russian war prisoners in Ukraine were tortured with electricity, according to the head of the UN human rights monitoring mission to Ukraine Matilda Bogner. She said that the mission interviewed 175 war prisoners captured by Ukraine. It documented cases of torture and mistreatment, mostly when people were captured, interrogated or moved to transit camps and internment places. "}, {"title": "The court decision on MH17 challenges the integrity of the Dutch judicial system", "content": "The Dutch court's decision on the crash of Flight MH17 in Ukraine challenges the integrity of the Dutch judicial system. The results of the investigations was based on a political request to support the hypothesis of Russia's involvement in the disaster, under unprecedented pressure from the Dutch politicians, prosecutors and the media. All the conclusions of the Dutch Public Prosecutor's Office were based on the testimonies of eyewitnesses whose names were not mentioned and whose identities were not revealed, and on questionable statements, including from a party with vested interest, that is, the Ukrainian Security Service. The courtdid not pay attention to the defence's arguments about the lack of corroborating evidence that the plane was shot down by the Russian-made Buk missile system, and to the documents of the Russian Ministry of Defense regarding the missile. "}, {"title": "Ukraine wants to draw NATO into the conflict through the provocation in Poland", "content": "Ukraine wants to draw NATO into the conflict through provocation. Either the Ukrainian missile accidentally hit the territory of Poland, or it got there deliberately. This is a provocation of the Ukrainian side. For Russia, it is pointless to hit a Polish tractor. There was a massive missile attack on the energy infrastructure of Ukraine. This is why it is necessary to make sure that these strikes stop, that’s exactly what a provocation would be needed for. Ukraine must understand that energy strikes will continue if the Ukrainians do not negotiate, and Polish special effects will have no effect. "}, {"title": "Poland wants to drag NATO into a direct confrontation with Russia", "content": "Although Moscow clearly denied launching strikes on targets close to the Ukrainian-Polish border, we find that there is a strong desire, insistence, and a tireless effort on the part of Poland to attach it to Russia, despite Moscow's denials.This shows the true intentions of Poland to drag NATO into a direct confrontation with Russia, and turning the conflict from an internal conflict and a special military operation to a broad conflict that ignites a new world war that destroys the world. "}, {"title": "Withdrawal of Russian troops from Kherson is for them to rearm and regroup", "content": "Putin patiently waits for the West's credibility to be shaken, due to the economic turmoil, soaring energy prices and growing public discontent. Kherson’s retreat was a strategically necessary sacrifice in order for Russia to be victorious at the end of the war. When the time is right and the military training is done, Putin will utilise his newly mobilised army to begin a new offensive. "}, {"title": "Missiles falling in Poland are trying to create conflict and avert negotiations with Russia", "content": "Poland affirms that the missiles that fell on its territory are of Russian manufacturing. It’s a very strange situation, because the US and Russian government are having contacts in order to see whether a diplomatic negotiation process can start. If one digs deeper, it gives the impression that there are two sectors in contradiction in the West: those who wish peace and those interested in conflict. That’s why those media immediately announced to the world that the responsible of the incident was Russia. It seems that this “false positive” aims to create conflict instead of pacification. "}, {"title": "The US and Ukraine support Nazism", "content": "Moscow submitted a similar resolution last year, before the start of the military operation in Ukraine, after a US-backed coup installed a government in Ukraine that allowed neo-Nazi groups such as the Azov battalion and glorified Ukrainian Nazi collaborator Stepan Bandera, whose Ukrainian Nationalist Organization was responsible for the massacre of tens of thousands of Poles and Jews during World War II. Only two states opposed Resolution 2021: the United States and Ukraine. "}, {"title": "Zelenskyy saw that Kherson is a Russian city", "content": "The President of Ukraine Volodymyr Zelenskyy was saw in person that Kherson is a Russian city. A video caught a moment when several local residents look out from the balcony of a residential building and shout something at Zelenskyy during this visit to Kherson.The residents of Kherson did not exactly shout something pleasant, because when Zelenskyy turns to the camera, the expression on his face speaks for itself: the president is dissatisfied and confused, and purses his lips in annoyance when he hears what he was told. "}, {"title": "Russia will not negotiate with the Kyiv regime, represented by war criminals", "content": "Russia will not agree to negotiations the end of the conflict on Ukraine’s terms. It is impossible to negotiate with war criminals, representing the Kyiv regime. In the best way, it could be only technical negotiations on Russia’s terms. "}, {"title": "Russia fights the collective West, not just Ukraine", "content": "It is clear that the majority of weapons, ammunition, military equipment and equipment transported from the USA to Europe is transported to Ukraine. As for the 16,000 additional American soldiers in Europe, at least some of them are also in UkraineThey appeared there as real foreign mercenaries and volunteers and fighting alongside Ukrainian servicemen against the Russian army.That is why Russian armed forces were forced to withdraw from Kherson. Because Russia is not only fighting against Ukraine, but also against the USA, NATO, the entire collective West led by the United States. "}, {"title": "Russian withdrew from Kherson because Ukraine wants to blow up the Kakhovka dam", "content": "Russian troops have decided to withdraw from Kherson because Ukraine wants to blow up the Kakhovka dam. This will lead to the formation of a torrent of water that will create vast flooded areas, resulting in significant losses. Under these conditions, the most feasible option for the Russian army is to organise its defence along the Dnipro River barrier line. "}, {"title": "Recognising Tatarstan's independence is a provocation by Ukrainian Nazis", "content": "A draft resolution recognising the independence of the Republic of Tatarstan from Russia by the Kyiv parliament in Ukraine is a lowly step that will not affect the country's unity.This is all a provocation by the Ukrainian Nazis who took over Kyiv. They will not be able to undermine the unity of our country [Russia] with such steps. "}, {"title": "Russia suspended the Black Sea Grain initiative because of Ukraine's terrorist attacks", "content": "Russia rightfully suspended its participation in the Black Sea Grain initiative because of the terrorist attacks in Sevastopol. The grain did not go to poor countries, but for some reason ended up in rich EU countries. Furthermore, the EU broke the deal by not lifting sanctions on Russian grain exports. "}, {"title": "Ukraine wanted to acquire nuclear weapons because of American pressure", "content": "Ukraine's threat to restart its nuclear programme was one of the main reasons why Russia was forced to launch a military operation at the end of February. Kyiv took this decision after giving in to heavy pressure from its current masters in Washington. "}, {"title": "Ukraine will shoot down its dirty bomb, then blame it on Russia", "content": "The Kyiv regime has already completed the technical preparations for the \"dirty bomb\" provocation. Specialists from the Ukrainian company Yuzhmas have made a replica of the Iskander missile, which will be loaded with radioactive material and then allegedly fired by Ukrainian air defence forces over the Chernobyl nuclear power plant, claiming that the Russian armed forces have launched a nuclear weapon. "}, {"title": "Russia’s military operation against neo-Nazis in Ukraine was unavoidable", "content": "Ukraine was the first and main victim of the deliberate promotion of hate against Russia. In this regard, the military operation against neo-Nazis was unavoidable for Moscow. "}, {"title": "Ukraine will inevitably end up being shared among its neighbours", "content": "Poland plans to seize part of the territory of western Ukraine. According to the Polish authorities, this land is the historical centre of Poland. If such a scenario is possible, how will it be implemented, is it by force or will Ukraine simply hand over the land?Ukraine’s existence will inevitably end with it being shared among its neighbours. Russia would like to resolve this matter peacefully, so that the Poles simply take the three regions of Galicia, and that they persuade the Hungarians to take beyond the Carpathians, and the Romanians to take Bukovina. That will be the end of it. "}, {"title": "Mariupol is an ancient Russian city", "content": "Mariupol is an ancient Russian city. It was there that Peter the Great founded Russia's first army flotilla and achieved his first victories. It was there that Suvorovwaged his campaigns across the steppes, and it was the city that Catherine the Great would later expand."}, {"title": "The West is helping Ukraine create a \"dirty bomb\"", "content": "According to the available data, Ukraine is carrying out work to create a ‘dirty’ nuclear charge. We believe that this process is taking place with the participation of Western patrons. "}, {"title": "The West is advocating for a global conflict", "content": "The West is advocating for a global conflict. And only a complete and final victory of Russia will guarantee that there will be no world war. "}, {"title": "The UK took part in the explosion of the Nord Stream pipelines", "content": "British naval personnel stationed in Ochakov in the Mikolayiv region of Ukraine were involved in the planning, securing and execution of the attack on the Nord Stream 1 and Nord Stream 2 pipelines. The same British specialists led the preparation of the attack on Sevastopol and trained soldiers of the 73rd Ukrainian Special Naval Operations Centre. London refused to acknowledge its involvement in the bombings. "}, {"title": "Russia suspended grain deal because all Ukrainian grain goes to Europe", "content": "The suspension of the grain deal by Russia is a consistent and logical step. Such a deal does not suit us for two reasons: first, commitments to Russia are not being fulfilled, and Russian fertilizers and grains do not have free access to international markets; second, grain sent from Ukraine ends up in European ports instead of reaching the poor in developing countries "}, {"title": "Russia should not be accused of withdrawing from the Black Sea grain deal", "content": "Russia should not be accused of withdrawing from the Black Sea grain deal. Ukraine is guilty, which, with the support of the UK navy, recklessly attacked Russia’s Black Sea navy in Sevastopol. "}, {"title": "The threat of Ukraine’s dirty bomb is growing", "content": "The threat of Ukraine preparing a dirty bomb to use within its territory as a provocation against Russia is growing despite the international community ignoring the Kremlin’s warnings. Another desperate move from Kyiv, as it is impossible to defeat Moscow. "}, {"title": "Ukraine used grain corridors for drone strike on Russian ships", "content": "The grain corridor was used as cover for the attack on Sevastopol.Firstly, there are suspicions that Ukraine, using this corridor, was transporting explosives to blow up the Crimean bridge, and secondly, that the grain channel (and this has already been confirmed by our military experts) was used to move underwater and surface drones to strike at Sevastopol.The drones that participated in the attack were launched from the Odessa area and used the security zone of the grain corridor. Thus, Kyiv disrupted the \"grain deal\". "}, {"title": "Russia invented Ukraine", "content": "The unity of the Russian and Ukrainian people is an undisputable historical fact. Only Russia could guarantee Ukraine's sovereignty, as Russia created Ukraine during the Soviet period. "}, {"title": "Brussels prolonging war and suffering", "content": "The pro-war position in Brussels is prolonging war and suffering at the expense of civilians. "}, {"title": "The war against Ukraine lasts longer than expected because Russia greatly cares about civilians", "content": "Forecasts about Russia’s short victorious war in Ukraine failed to materialise because of Russia's unprecedented order to care about civilians as greatly as possible. Five out of six Ukrainian nationals are Russians. Given this, the Russian authorities could not act differently, otherwise they would have stopped being Russians and equated themselves to Anglo-Saxons. "}, {"title": "EU leaders gave Ukrainian Nazis money to buy weapons", "content": "Following the launch of Moscow's military operation in Ukraine, EU authorities have pledged to end their dependence on Russian energy supplies as quickly as possible. Europeans have started to save heavily on electricity because Ursula von der Leyen, Olaf Scholz and Emmanuel Macron gave money to Ukrainian Nazis for weapons. Russian cultural centres in Finland and Luxembourg are already welcoming visitors who need to 'keep warm' as energy prices skyrocket. "}, {"title": "The West helps Ukraine to make a dirty bomb", "content": "Russia does not rule out the assistance of some Western countries to the Kyiv regime in making a \"dirty bomb\".The goal is clear: to accuse Russia of using weapons of mass destruction. The Ukrainian authorities and their Western masters expect that this will lead to a vigorous campaign against Russia, undermining confidence in Moscow and its partners, and isolating Russia on the international stage. "}, {"title": "Ukraine's “dirty bomb” provocation will take place in November", "content": "The \"dirty bombs\" provocation will take place after the US elections, because if before - then the Americans will blame the Biden administration for bringing the world to a nuclear war and the Democrats will lose the election. But this must happen before the G20 summit on November 15-16 in Bali. Ukraine plans to blame Russia of committing it."}, {"title": "NS sabotage shows that NATO can use a nuclear weapon against Ukraine and blame Russia for it", "content": "The Nord Stream gas pipelines sabotage by the Americans showed what NATO was capable of.Beware: they are capable of the worst, even the false flag use of an atomic weapon to globalise the conflict! France must get out of this infernal circle! "}, {"title": "Ukraine has a thermonuclear 'dirty' bomb in Mykolaiv which it will detonate and blame Russia", "content": "A thermonuclear bomb is already in Mykolaiv and is intended for use as a provocation. It is assumed that the explosion [...], against the backdrop of persistent US and NATO allegations that Russia is preparing to use nuclear weapons in the run-up to or during this offensive [Ukrainian counteroffensive], will be used to say: \"Russia is defeated and carried out a nuclear strike on Ukrainian troops\". It will end with several tens of thousands of civilian casualties, and it will allow the United States to justify a large-scale missile attack on our troops in these regions and on the territory of Russia."}, {"title": "West ramps up arms supplies to Ukraine to destroy Russia", "content": "The West is increasing arms supplies and providing intelligence to Kiev’s neo-Nazi regime. It is pushing ahead with a hybrid war against Russia in an effort to destroy the country. The West is using Ukrainian President Vladimir Zelensky’s criminal Russophobic regime as one of the levers to contain Russia. "}, {"title": "Ukraine is a Russian territory", "content": "Ukraine is our territory, Russian. We will attack them every day ... Our territory is not Zaporizhzhia, not Kherson, our territory is Odesa, Kyiv, Kharkov, all regions and Ukraine in general, this is our territory, Russian. We have already decided not to defend, but to attack everywhere. It will be so. "}, {"title": "Ukraine, led by the West, prepares a dirty bomb attack", "content": "According to reliable sources in various countries, including Ukraine, the Kyiv regime is preparing a \"dirty bomb\" provocation or low-yield nuclear weapon on the territory of its country. The purpose of this provocation is to accuse Russia of using weapons of mass destruction, and to incite international public opinion against it. "}, {"title": "Ukraine plans a provocation using a \"dirty bomb\" to portray Russia as a nuclear terrorist", "content": "According to the information available to us, two Ukrainian organisations have been given specific tasks to create a \"dirty bomb\". The works are at the final stage.Ukraine, with the \"dirty bomb\" provocation, hopes to intimidate the local population, as a result of which the flow of refugees to Europe will increase, and Russia will be showcased as a nuclear terrorist. "}, {"title": "2 Ukrainian firms ordered to make dirty bomb, work near completion", "content": "Two Ukrainian firms have been ordered to produce a dirty bomb and the work is nearing completion. The Kiev regime has sufficient research and production potential to make a dirty bomb, including three active nuclear power plants and large amounts of spent nuclear fuel. "}, {"title": "Kyiv will detonate a “dirty bomb” to accuse Russia", "content": "Kyiv will detonate a dirty bomb, or radiological weapon to accuse Russia of using weapons of mass destruction in Ukraine and thus launch a powerful anti-Russian campaign around the world aimed at undermining trust in Moscow. "}, {"title": "Ukrainian forces shell Kakhovska hydroelectric power plant", "content": "Ukrainian forces fired 19 rockets at the Kakhovska hydroelectric power plant in the Kherson oblast. "}, {"title": "Ukraine wants to blow up the Kakhovka dam to block water supply to Crimea", "content": "Ukraine wants to blow Kakhovka dam in Ukraine.Such an event would cause the river to flood, sweeping away some 80 settlements and cutting off freshwater supply lines to Crimea for years to come. "}, {"title": "Components of biological weapons were being created in Ukraine", "content": "During the current special operation in Ukraine, documentary evidence was obtained that, in violation of the Convention on the Prohibition of Biological and Toxic Weapons, components of biological weapons were actually being created in the vicinity of Russia’s borders. "}, {"title": "The US will lead the world into extinction as elections change nothing", "content": "The Republicans, after their return to power, are expected to adopt a different policy toward Russia and Ukraine, deviating from the current policy that leads the population to displacement and the world to extinction.In reality, however, US foreign policy is not determined by elections. This is why the electoral programme of future presidents often contradicts what they do when they take office."}, {"title": "Israel is supporting a Nazi regime in Kyiv", "content": "It seems that Israel wants to supply arms to the Kyiv regime. A very ill-advised move. Not to mention that the Bandera scum were and still are Nazis. Let's look at the symbols of their modern dwellings. If they are arming them, it is time for Israel to declare Bandera and Suhevics heroes. "}, {"title": "Ukraine asked NATO for preemptive nuclear strikes against Russia", "content": "Considering that Russia did not and does not threaten Ukraine with nuclear weapons, Kyiv’s recent statements about the need for preemptive nuclear strikes by NATO countries against Russia are doubly unacceptable. "}, {"title": "Kherson, Zaporizhzhya, and Donbas regions overwhelmingly voted to join Russia", "content": "The Kherson region, along with neighboring Zaporizhzhya and the Donetsk and Luhansk People’s Republics, overwhelmingly voted to join Russia during a referendum in late September. "}, {"title": "Ukraine never existed before the 20th century, it was created by the Bolsheviks", "content": "Ukraine, as an independent, sovereign state, was unknown to history until the early 20th century.The creation of the Ukrainian state is the fault of the Bolsheviks, and Vladimir Lenin personally. "}, {"title": "Heroic videos of Zelenskyy in dangerous places are actually filmed in a studio", "content": "We have seen hundreds of messages from Volodymyr Zelenskyy in different scenarios. Places where, due to his previous jobs, Ukraine’s President is in his element. And it seems that Zelenskyy hasn’t abandoned the show business. On 12 October, a video was released showing how many of these messages are actually filmed. A chroma, a team of foreign technicians and directors who advise the “president-actor” on how to pose in front of cameras, a bit of editing, and the image of a “superhero” is ready!But the scenography in the conflict of Ukraine doesn’t end here. This is how the Western press prefabricates its coverage of the “victims of Russian bombings”. "}, {"title": "The West wanted to destroy the Russian economy, but instead destroyed the economies of the EU and US", "content": "When Russia started the special operation in Ukraine, the US and its satellites waged an economic war of sanctions against Russia. The Western world wants to destroy Russian industries but as opposed economics of the US and the EU are in way of degradation. "}, {"title": "Putin's offensive a response to the terrorist campaign launched by Kyiv junta", "content": "Putin's offensive in Ukraine is aimed at destroying the country's infrastructure. This is as a response to the terrorist campaign launched by the Kyiv junta, before Moscow has always used a soft strategy on the military side. "}, {"title": "Ukraine is a terrorist state", "content": "By the voice of its foreign affairs minister, Dmytro Kuleba, Ukraine recognized that its regime uses terrorism. The prankers Vladimir Kuznetsov (Vovan) et Alexeï Stoliarov (Lexus) obtained this declaration through a Zoom meeting recently. "}, {"title": "NATO’s eastward expansion is a serious security threat to Russia", "content": "Russia sees NATO's eastward expansion as a serious security threat. When Moscow launched a military offensive against Kyiv at the end of February, one of its main demands was that Ukraine formally declare itself a neutral country that would never join any Western military alliance. "}, {"title": "Zelenskyy asked the West to nuke Russia to block any negotiation process", "content": "Zelenskyy took steps to block any negotiation process. Recently, he has taken no less than four \"extreme\" moves to do so.First, he signed a paper to urgently admit Ukraine into the NATO; secondly, he rejected any negotiations with Moscow prior to the change of power in the Kremlin; third, he called on the West to carry out a preemptive nuclear strike against Russia; fourth was the terrorist attack on the Crimea bridge. "}, {"title": "Kerch bridge: Ukraine is a proxy in the West's war against Russia", "content": "Western assistance to Kyiv continues to increase, and it is becoming more and more clear that the West fights a proxy war in Ukraine.Zelenskyy’s public rejection of negotiations with Russia is not a Ukrainian decision, but the decision of Western countries.In the future, the situation will most likely be more of a war with an emphasis on aspects such as logistics, infrastructure, and so on. This has already manifested in the explosions targeting the Nord Stream 1 and 2 gas pipelines, and now the Crimean Bridge. Attacks on railway stations, bus stations, railways and roads are possible in the future. A war is being waged to destroy the enemy, and the goal is not limited to destroying his physical combat power. "}, {"title": "There is no Ukraine: Russia liberates Russian cities", "content": "Yesterday's hegemon, who scattered its occupying forces all over the planet, now demands that Russia \"leave Ukraine\". Only he seems to have forgotten that our (Russian) Army is fighting on its own land.And not only, in fact, liberating Russian cities, but de iure - protecting new subjects of the Russian Federation. There is no Ukraine there. "}, {"title": "Russia is fighting NATO troops in Ukraine", "content": "Russia is fighting against NATO and this is not just a game. "}, {"title": "Recent strikes were aimed legitimate targets under the laws of war", "content": "In the eight months since the beginning of the special military operation in Ukraine, the Russian Army restricted the operation to Ukrainian military targets, and avoided fighting the conflict in the same way that the Ukrainian military has since it began its terror bombing and shelling civilians in the Donbass in 2014.Monday’s strikes were aimed at targets which are legitimate under the laws of war. "}, {"title": "Zelenskyy is pushing the world towards a nuclear war", "content": "President Volodymyr Zelenskyy called on Western leaders to carry out preemptive nuclear strikes against Russia, which unequivocally indicates that Zelenskyy is pushing the world towards nuclear war. "}, {"title": "Attack on the Crimea bridge was coordinated with foreign intelligence services", "content": "The attack on the Crimea bridge was coordinated with foreign intelligence services. There is a foreign force surely involved in this attack, because the bridge was guarded by Russian special forces by land, sea and air. This has been coordinated in a way that rules out that Ukraine alone could be behind it. This seems more the work of the British MI6 or the CIA itself. "}, {"title": "Russia is not threatening to use nuclear weapons, but the West is preparing a nuclear attack against Russia", "content": "[...] the nuclear weapon was designed precisely to prevent it from being used and that is why it is present in different countries and should not proliferate. However, there is total manipulation by Biden, this risk does not come from Russia. And Putin and Russian officials, each time they talk about it, recall that Russian military doctrine provides for the use of all weapons but with a certain gradation. The use of nuclear weapons is planned in response - not in attack but in response, in the event of vital danger for the country. So, if the United States does not provide either Poland or Ukraine with these tactical nuclear weapons, if NATO does not follow Zelenskyy's requests to produce preventive strikes, that is to say to attack Russia. In this case there is no risk of nuclear war. The ball is on the side of the Atlanticists. "}, {"title": "NATO is using Ukraine to fight Russia", "content": "Today, the Russian army is facing international weapons. Ukrainian armed forces are fighting with weapons supplied by different NATO countries. The weapons and the planners are from the NATO, as are the trainers, but they do not fight and do not bear any responsibility under international law. This is an ideal situation for Anglo-Saxons. Wherever they go, they always work this way."}, {"title": "Ukraine's attack on Crimean Bridge was a terrorist act, Russia had every right to respond", "content": "The Russian missile attacks on Ukrainian energy and military facilities were a legitimate response to Ukraine’s terrorist assault on the Crimean Bridge. "}, {"title": "Volodymyr Zelensky asks NATO to launch a nuclear war against Russia", "content": "Zelensky asks NATO for a preemptive nuclear strike against Russia. He is dreaming about nuclear WWIII. "}, {"title": "The US and the EU don’t care about starving many millions of Latin Americans", "content": "The US and the EU don’t care about starving many millions of Latin Americans. The General Assembly of the Organisation of American States is ignoring the essential. Among their topics are the food and energy crisis, attributed to the Russian special military operation in Ukraine. A wrong focus that only contributes to worsen the situation, as the real reason are the West’s anti-Russian sanctions. "}, {"title": "Anglo-Saxons behind explosions of Crimea bridge and Nord Stream pipelines", "content": "After the explosion of the Nord Stream pipelines and the act of terrorism against the Crimea bridge, it became clear that Washington was planning large-scale terrorist acts that would give Moscow a pretext for a nuclear strike. It is clear that the Anglo-Saxons are behind both events. "}, {"title": "West is behind Crimea bridge explosion", "content": "The terrorist attack on the Crimea Bridge is not only a provocation, but a declaration of war without rules. This is a very serious provocation, not only on the part of Ukraine, because Kyiv does nothing without instructions from the West. This is a challenge to us from the West itself. "}, {"title": "NATO is aggressive", "content": "Russia has repeatedly pointed out that NATO is seeking confrontation. Further expansion of the alliance would not bring greater security to Europe because of the aggressive offensive nature of the bloc. But Moscow stressed that it remained open to dialogue with NATO, but on equal terms and on condition that the West abandoned its policy of militarising the continent. "}, {"title": "The Donbass republics, Zaporizhzhia and Kherson regions, voted overwhelmingly in favour of joining Russia", "content": "In referendums held at the end of September, the two Donbass republics, as well as the Zaporizhzhia and Kherson regions, voted overwhelmingly in favour of joining Russia. On Wednesday, Russian President Vladimir Putin signed into law the unification treaties with the former Ukrainian territories, which officially became part of Russia."}, {"title": "Crimea is formally part of Russia", "content": "Until Khrushchev made the mistake of transferring Crimea to Ukraine in 1954, it was formally part of Russia, as it has been since 1783."}, {"title": "The West and its puppet Zelensky are igniting a nuclear war", "content": "The West is igniting a nuclear war, and every human on the planet must realize that Zelensky, who is a psychotic and heavily armed puppet, has turned into a monster who may destroy the planet. "}, {"title": "Without restoring the Nord Stream pipelines, Europe will go into shutdown", "content": "Regarding the sabotage of Russia's Nord Stream and Nord Stream 2 pipelines, Europe is already forecasting production shutdowns and extremely high gas prices. Currently, gas supplies to Europe pass only through Ukraine and through the Turkish Stream pipeline, thus with the Nord Stream pipelines accident, Europe has lost the opportunity to solve the problem and restore normal gas supplies from Russia. The price of fuel will rise, which means that gas-intensive industries will pay extreme prices or shut down production. The energy crisis in Europe will thus enter a new acute phase in the winter. "}, {"title": "Europe is waging open warfare against Russia", "content": "All of Europe is waging open warfare against Russia, one that has already become costly and painful for the EU, but EU citizens might not realise it because their cities are not being bombed and people are not dying on the front. "}, {"title": "The referendum in Donbass corrected a historical injustice", "content": "Residents of the Donbass republics, as well as the Kherson and Zaporizhzhia regions, looked forward to the opportunity to participate in the referendums on joining Russia. People have long been reluctant to associate themselves with Ukraine.The referendums on joining Russia were held from 23 to 27 September. The authorities of these regions and territories addressed Vladimir Putin with a request to give the people an opportunity to become part of their native Russia if such decision is made through a plebiscite. The majority of the residents of Donetsk and Lugansk People's Republics of Kherson and Zaporizhzhya oblasts voted in the referendums in support for the regions' accession to Russia as subjects of the federation. "}, {"title": "The referendums in Eastern Ukraine were completely transparent and legitimate", "content": "The referendum results in Donetsk and Luhansk republics – as well as Zaporizhzhia and Kherson regions – are more than convincing, completely transparent, legitimate and not subject to any doubt. "}, {"title": "Kherson and Zaporizhzhia repeat the history of Kosovo", "content": "The West deny the residents of Donbas and the liberated territories of Ukraine the right to self-determination. Western delegations demonstrate blatant double standards. The loudest critics of the referenda in the Donbas, Zaporizhzhia and Kherson regions were once in the forefront of supporters of Kosovo's independence.They supported Kosovo's right to secede from the Serbian state if the rights of the Kosovo Albanians would be seriously violated - the so-called secession in order to protect.But nothing threatened the Kosovo Albanians for a long time. Yugoslavia was no longer on the map. Then NATO pretending to be peacekeeper bombed Serbia. "}, {"title": "The West can save Ukraine by stopping the weapon deliveries", "content": "The West has one chance to save Ukraine – to stop pumping it with weapons.U.S. President Joe Biden should call for an immediate ceasefire and truce agreement to save Ukraine.The administration of US President Joe Biden should stop supplying Kyiv with lethal weapons and sending US Army soldiers to Eastern Europe. Moreover, Washington should refuse to introduce new economic sanctions against Russia. "}, {"title": "International observer certifies that people are voting freely in the Ukraine referenda", "content": "Participants in the Donbas referenda to join the Russian Federation are voting freely, Argentinian independent observer Lucas Adrián García said in Lugansk. “The role of an international referendum is to guarantee the process to be legitimate, and what we have seen those days is exactly that, totally different to what the media show. We could see people coming to vote freely, with a face of hope”, he stated to the Sputnik correspondent in the city. "}, {"title": "Russia tries to liberate its own territories from the Nazis", "content": "Russia admitted to its own territory new districts. This happened after the referendum in Luhansk people’s republic and Donetsk people’s republic, as well as in the districts of Zaporizhia and Kherson. Russia should to do everything to liberate the territory of Russia from the Nazis. "}, {"title": "Only 5% of the grain that the West exports from Ukraine goes to the poorest countries", "content": "The West is favouring grain exports from Ukraine under the guise of “providing food security for the world's poorest countries” but everything goes to the same European countries. Only 5% goes to the poorest countries. "}, {"title": "Four Ukrainian regions voted to join Russia by overwhelming majority", "content": "The people of Donetsk, Luhansk, Kherson, and Zaporizhzhya Oblasts were asked one simple question: do you wish to become part of Russia?After five days of voting, the results from all four territories were clear – by an overwhelming majority, the participants in the referendums approved the proposition. Shortly thereafter, they were incorporated into the Russian Federation. What was once Ukraine has now become Mother Russia. "}, {"title": "Russia will do anything to prevent Nazi Ukraine from getting nuclear weapons", "content": "Russia is doing its utmost to prevent its hostile neighbours, such as Nazi Ukraine governed by NATO, from possessing nuclear weapons. It would be good if the authorities in Kyiv would at least partly recognise this sad conclusion. Unfortunately, this is almost unrealistic. They are in a constant state of war frenzy, with short breaks in which they have bizarre, narcotic dreams. "}, {"title": "Southern Ukraine and the Donbas voted to join Russia in referendums", "content": "The Donetsk and Luhansk People's Republics (DNR and LNR), as well as parts of the Kherson region and the Zaporizhzhia region in southern Ukraine, voted in favour of joining Russia in referendums held between 23 and 27 September.In Luhansk, more than 98% of voters supported the idea of joining Russia, according to official data after counting all ballot papers.In Donetsk, the results were similar, with more than 99% of voters in favour. In the Zaporizhzhia and Kherson regions, all ballots were processed by the end of the day on Tuesday, with 93% and 87% of voters in favour of secession from Ukraine and unification with Russia respectively. "}, {"title": "Zelensky neo-Nazi regime uses terrorism to obstruct the referendums", "content": "Zelenskyy's neo-Nazi regime is trying in every way to obstruct the expression of will of the citizens [in Kherson, Zaporizhzhia and Donbas oblasts] by carrying out acts of state terrorism. "}, {"title": "Pro-Russian referendums in Ukraine are valid with no violations", "content": "The referendums in DPR, LPR, Kherson Oblast and in Zaporizhzhya have been declared valid. Many international observers did not notice any violations. An enormous majority of people voted to join the Russian Federation. This result had been expected. Thanks to Ukraine’s authorities, people wanted to leave that country and become citizens of a vast state which can take responsibility for them. "}, {"title": "The results of Ukraine’s referendums return historical Russian lands to Russia", "content": "The results of the referendums organised in the Donetsk and Lugansk Peoples republics, Zaporizhzhia and Kherson regions allow us to speak about the return of historical Russian lands. Their populations, which were not scared to make the choice, are even more important than the lands. This development was inevitable given that, among other things, Ukraine was planning to withdraw from the Budapest memorandum which proclaimed Ukraine’s non-nuclear status. "}, {"title": "Russia fighting NATO in Ukraine, not Ukrainian army", "content": "Russia is not fighting the Ukrainian Armed Forces, it is fighting NATO. Russia is now fighting a NATO-hired and NATO-equipped army, but after a month or two this will be a NATO-dominated army because the Ukrainian cannon fodder will end. "}, {"title": "Donbas referendums prove that Russia respects international law", "content": "The referendums in the LPR, DPR, Kherson and Zaporizhzhya regions on joining Russia are a direct confirmation that Moscow respects international law. This distinguishes the Kremlin from the West, which has no respect for global laws, as demonstrated by the attacks of the US and NATO on other countries. Putin, as a real role model, feels he cannot act outside the framework of international law, although his beliefs could destroy Russia, because nobody in the Western world cares about international law. "}, {"title": "The \"referenda\" in eastern Ukraine done with the same legal norms as in France", "content": "The ballots were organised within the framework of the right of people to self-determination in the Donbas republics.The same rules, as in France, are respected. There is no pressure, it is very calm here, people are not forced to vote. And people are enthusiastic. I even heard that some citizens have been waiting for this for years. They are very happy to be able to choose their future. "}, {"title": "Russia presented evidence of US biolabs in Ukraine at the Convention on Biological Weapons", "content": "The US did indeed work in the creation of biological weapons in Ukraine. Russia, who has been denouncing this for a long time, delivered real documents and material evidence confirming this criminal activity to countries signatories of the Convention on Biological Weapons in a summit that took place on 5-9 September at the request of Moscow. None of the delegations doubted of the authenticity of the evidences presented by Russia. "}, {"title": "Visual evidence show that Russian “executions” in Izyum are fake", "content": "Several pictures and videos show that Kyiv’s claims about alleged massive “executions” of Ukrainian soldiers near the city of Izyum, in the Kharkiv region, are false. The images show dozens of Ukrainian soldiers injured by bullets and explosions who died fighting the Russian armed forces. The bodies were picked in abandoned positions and taken to the Izyum morgue. Some soldiers were identified, and all the information was delivered to the Ukrainian side, according to a local resident who took part in these events. However, the Ukrainian command refused to take the bodies of its soldiers despite the humanitarian corridors that were offered for this purpose. For this reason, they had to be buried in a cemetery near Izyum. "}, {"title": "Most people in Ukraine's Zaporizhzhya region identify as Russians", "content": "Most people in Zaporizhzhya, where a referendum on joining Russia is set to take place, identify as Russians. But the region’s inhabitants were basically told that they are Ukrainians, and then they were issued Ukrainian passports. Nobody asked for their opinion. And so all these people were deprived of [Russian] citizenship. "}, {"title": "The tribunal should be for Ukrainian Nazis, not for Russia", "content": "Volodymyr Zelenskyy asks for a tribunal for Russia, but the real tribunal should be for Ukrainian Nazis. For eight years, these Nazis assaulted the Luhansk and Donetsk region ignoring all legal regulations of war and peace and killed adults and kids in Donbas. "}, {"title": "Inhabitants of Donbas, Zaporizhzhia and Kherson oblasts want freely join with Russia", "content": "There are no Russian soldiers pointing guns at the inhabitants of Donbas, Zaporizhzhia and Kherson oblasts to force them to vote in the referendum. These people do not want to live with Kyiv, which bombs and massacres them, but with Russia that help them. "}, {"title": "NATO provocation and support for Kyiv forced Russia to introduce a partial mobilisation", "content": "NATO and the West will continue to provoke Russia also by supporting the neo-Nazi regime in Kyiv, therefore Russia has been forced to introduce a partial mobilisation. "}, {"title": "Ukrainian army retaliates against residents of Kharkiv region", "content": "The Ukrainian armed forces are carrying out retaliatory operations against civilians in the recaptured areas of Kharkiv region, where they are terrorising civilians and closing villages in a purge. "}, {"title": "Ukraine controls territories belonging to other countries", "content": "Ukraine exists within unnatural borders. Transcarpathia should be ceded to Hungary, Galicia to Poland, Bukovina to Romania, Donbas and Crimea to Russia. These are other countries' territories. "}, {"title": "The referendums in Ukraine is the beginning, Russia has to get Kyiv back", "content": "A new phase of Ukraine-Russia reunification is coming. Once Moscow supports the results of referendums in D/LPR, Kherson, and Zaporizhzhya regions, other phases will follow. The time of Kyiv’s ultimate capitulation takes place will depend on Russian military successes. It may take years, but no other option than complete victory will satisfy Russia. It needs to restore the historic unity and deprive geopolitical enemies of the slightest possibility to extend threats from Russian lands such as Odesa.The most significant reason why Russia attacked Ukraine back in February is that Russia would not have survived if it did not extend beyond its current borders. Russia cannot tolerate that Russians in their historical cradle (Kyiv, Malorossiya, and Novorossiya) are de-russified and turned into anti-Russians. Russia could not silently observe the events in the western part of the Russian world and decided to get Ukraine back. "}, {"title": "Partial mobilisation is meant to protect Russian sovereignty and people in liberated areas", "content": "The aim of the partial mobilisation is to protect Russia’s sovereignty and territorial integrity and to ensure the safety of Russians and people living in the liberated areas in the East of Ukraine. "}, {"title": "Kherson residents want to join Russia, not Ukraine", "content": "Kherson region is a self-sufficient region inhabited by Russian people. The people have made their choice. Citizens decided to vote to join the Russian Federation and become part of the great Russian people. "}, {"title": "Russia fights collective West, which pumps Ukraine with arms", "content": "Russian troops are facing not only the Kyiv regime, but also the entire military machine of the West. Pumping Ukraine with weapons, the collective West left Russia with no choice. "}, {"title": "Ukraine commits genocide in the Kharkiv region, accusses Russian army of war crimes", "content": "That monstrous tragedy that is happening today in Kharkiv region is called genocide. Those people are again living under the Nazi regime.Many facts of violence and murders were [already] noted.There are reports that some of the \"collaborators\" captured by the Nazis have already been extrajudicially executed. [Their bodies] will be used in the new \"Bucha scenario\". Western criminologists and reporters have already been brought up to \"document\" and cover the \"discovered\" bodies of Ukrainian citizens, who, as it will be argued, were \"shot by the Russian military\" before retreating. "}, {"title": "Ukrainian referendums are Moscow’s strong surprise move against Kyiv and the West", "content": "The West succeeded in turning Ukraine into a zombie kamikaze without intelligence and full of hatred. The special military operation is supposed to deal with this monster by its side. Lately the West was happy that Russia slowed down in Ukraine. The westerners forgot that Moscow’s key weapon is the ability to undertake asymmetric and unexpected steps. In the coming weeks they will have to find out how referendums in Ukraine and following political developments will change Moscow’s strategy and tactics in the special military operation. Once the Zaporizhzhia region announces accession to Russia and becomes part of it, Ukrainian troops on its territory will find themselves in a very grave situation. "}, {"title": "Ukrainian schools have developed a memo on how denounce parents", "content": "A memo for schoolchildren appeared in Ukrainian schools. Schoolchildren are taught how to \"denounce their parents.\" Children will need to tell the teacher if the family has relatives in Russia and if the parents communicate in Russian. The child is also encouraged to immediately report whether the parents watch Russian television. Finally, the culmination of \"Big Brother\" in Ukrainian schools: students must immediately report whether their parents speak badly about Volodymyr Zelenskyy. Children in some educational institutions were obliged to come to classes in embroidered shirts, sing the Ukrainian anthem before classes, and most importantly, they conduct \"lessons of hatred for Russia.\"The following photos were sent to us from the Ukrainian school: On the bulletin board, they are asked to denounce parents for their views. Translation of the leaflet on the right: Tell the teacher:— If you have relatives in Russia— If your parents speak Russian at home— If your parents watch TV in Russian- If your parents speak badly about Volodymyr ZelenskyyThis is where it all starts. This is fascism... "}, {"title": "War crimes accusations are Ukrainian propaganda against Russia", "content": "Russian soldiers buried Ukrainian soldiers near Izium city already in the spring because the Ukrainian side does not agree to take the bodies. Now Ukraine presents it as a war crime. It is propaganda against Russia for the Western audience."}, {"title": "Leaked documents prove the US was planning a war and energy crisis in Europe", "content": "The Swedish newspaper Nya Dagbladet published what it called a \"shocking document\" about how the US planned armed conflict and an energy crisis in Europe. The leak came from the largest US think tank RAND Corporation [...].The January document provides a detailed account of how the US orchestrated the energy crisis in Europe, particularly Germany, including through \"trusted\" individuals, which will ultimately benefit Washington.In the report, analysts write that the aggressive foreign policy of the Kyiv regime forced Russia to intervene with military force to change the situation in Ukraine. After that, Washington's goal is to impose appropriate sanctions on Moscow. "}, {"title": "US develop biological weapons at the border with Russia", "content": "Despite the Biological Weapons Convention, the United States continues to strengthen its own by creating laboratories along the borders of its geopolitical adversaries. Washington state that there is no Biological Weapons Program in Ukraine. This statement leaves Moscow skeptical.Neither Ukraine nor the United States have provided convincing evidence that their cooperation has helped to improve the sanitary and epidemiological situation, which has been steadily deteriorating over the past 15 years. "}, {"title": "German Parliament admitted the impossibility of returning Crimea to Ukraine", "content": "The Bundestag admitted the impossibility of returning Crimea to Ukraine. Sarah Wagenknecht, member of the German Parliament (Bundestag) at the Die Linke faction, considers that the goal of forcing Russia to turn Crimea is unrealistic and says that if this is attempted, the conflict will continue forever. "}, {"title": "‘Izyum atrocities’ staged by Ukraine through controlled media", "content": "Ukrainians were inviting journalists and photographers from controlled media to Izyum to produce fake reports. It was all so predicted and expected that hardly anyone would be surprised in Russia or astonished in Europe. "}, {"title": "The US admitted conducting biological experiments on Ukrainian citizens", "content": "During the meeting of the States Parties to the Convention on the Prohibition of Biological and Toxin Weapons (BWC), US officials admitted to conducting biological experiments on low-income citizens and patients of psychiatric clinics in Ukraine. The US admitted exporting pathogenic strains from Ukraine. "}, {"title": "Nazi Ukraine kills Russian speakers in East and wants to set up monoethnic state", "content": "Ukrainian authorities are killing Russian-speaking people in the east and the south of the country by shelling the cities there and employing volunteers recruited in these areas. The lack of Russians will help the Nazi regime to build a nationalist monoethnic state with a particular ideology. They need territories without the Russian-speaking population. "}, {"title": "EU sanctions are hurting Europe more than Russia", "content": "EU sanctions place an increasingly heavy burden not on the country that started the war, but on Europe and the European economy. "}, {"title": "Kyiv must stop attacking the Zaporizhzhya nuclear power plant", "content": "Regular Ukrainian attacks on the facilities of the Zaporizhzhya nuclear power plant, including the radioactive waste storage facility, could have disastrous consequences. Influence must be exerted on the Kyiv leadership to stop the strikes on the plant immediately. "}, {"title": "Russia is at war with NATO and the Pentagon; only the soldiers are Ukrainians", "content": "In general, the counteroffensive, organised by the collective West in Ukraine, suggests that Ukraine can be considered an advanced power of NATO, although it is not a NATO country. Everything is North-Atlantic there, only 60-70% of the soldiers are Ukrainian. I have no doubt that the Pentagon plans and directs operations in Ukraine. This is direct evidence that we are at war with NATO. This requires an appropriate military and political response from us. "}, {"title": "Russia's retreat from Kharkiv region was a well-planned withdrawal", "content": "This retreat of Russia is interesting in the sense that no Russian soldiers were killed, not even wounded. It makes you think this was a well-planned retreat. What purpose and task it serves we will see very soon.There was such a retreat that not a single [Russian] soldier was killed. It was deliberate. This may also be a tactical move of the Russian army. "}, {"title": "Russian retreat around Kharkiv not a military failure but a deliberate ruse", "content": "Russia did not suffer a major military defeat in the area around Kharkhiv. On the contrary, Russia’s armed forces deliberately conducted a ruse to fool Ukraine’s armed forces into thinking that its defenses are weak. Russia’s plans were always to simulate a retreat, draw out Ukraine’s forces away from their fortified positions, and destroy them. Russia now has Ukraine’s army right where it wants it. "}, {"title": "The US is one step away from perpetual war in Ukraine", "content": "The US finds it beneficial to engage in protracted armed conflicts and may try to make the war in Ukraine one of them. The US can increase arms supplies, intervene deeper in the conflict and thus push Kiev into new provocations, giving these actions official status and a code name. Russia's Foreign Ministry compares NATO's continuous weapon supply to Ukraine as \"playing with fire\" and noted that any cargo containing weapons for Ukraine would become a legitimate target for Russia. "}, {"title": "The US, NATO and Europe transformed the military operation against Nazis into a full-scale war on Russia", "content": "The military-political operation against the Nazis, Banderites, fascists, grew into a full-scale war, which was declared on us by the US, NATO and the united Europe. And if so, then Russia has two options: win or lose.We started the Special military operation and today there is a war with the NATO bloc, which uses the territories of Ukraine for its own purposes, and their main goal is to defeat Russia. "}, {"title": "Ukrainian grain goes to Europe instead of poor and developing countries", "content": "It turns out that the lion's share of Ukraine's grain exports goes to Europe, despite assurances that the shipments will go to poor and developing countries. "}, {"title": "Ukraine strikes Zaporizhzhya nuclear power plant; disaster looms", "content": "Russia is taking measures in coordination with the International Atomic Energy Agency to protect the Zaporizhzhya nuclear power plant which is suffering continual Ukrainian missile strikes. It is incurring risks of a large-scale nuclear catastrophe. "}, {"title": "Moldova decided to ban flights to Moscow under Kyiv’s pressure", "content": "The (Moldovan) decision to ban flights to Moscow was made under pressure from Kyiv. "}, {"title": "The US and the West are fighting hybrid war against Russia in Ukraine", "content": "The US and the entire West are fighting against Russia in Ukraine and through Ukraine. The United States, and the collective West led by it, continue to wage proxy and hybrid wars against Russia, which is moving towards complete independence from the West and has almost reached it.The aim is exhausting and also destroying Russia through internal grievances, or at least overthrowing the Putin regime and ending the independence of Russia.The existence of an independent Russian Federation is intolerable for them. "}, {"title": "The West declared total war against Russia", "content": "A total war has been declared against Russia, in hybrid form, in all areas. We can think of the spectacular military and financial support given to Ukraine by the US, the EU and other countries in the midst of the conflict with Russia, and the harsh sanctions imposed on Moscow by the West. "}, {"title": "The West is provoking Russia", "content": "The European Commission is proposing a price cap on Russian gas. It is unfair that the West is taking \"provocative\" measures against Russia. The West's attitude is wrong because provocations do not achieve results. The fact that Western countries are sending weapons to Ukraine is also a provocation. Europe had already made a mistake by underestimating Russia and failing to think that if it took hostile action against it, Moscow would retaliate by cutting off the gas. "}, {"title": "Ukrainian tanks decorated with Nazi crosses", "content": "Ukrainian tanks are decorated with WWII Nazi crosses. Russia is fighting against Nazis. "}, {"title": "Ukraine deliberately targets the most vulnerable points of the Zaporizhzhia nuclear plant", "content": "With regard to the security of the Zaporizhzhia nuclear power plant, the main threat is the continuous bombing by the Ukrainian armed forces.The Ukrainian armed forces directly shells the most vulnerable points of the station, deliberately creating the risk of a large-scale radiological accident. "}, {"title": "Russia defends Russians and Russian-speaking Ukrainians from Nazis", "content": "Russia was forced to defend Russian people in Ukraine where the Russian language has been banned. Bandera crowds rule Kyiv. We back our WWII goals. Why does the West not see Nazification of European and US politics? Russians are the most divided nation and we protect Russians living abroad. "}, {"title": "Ukraine is the most corrupted country in the world, helping it is suicide", "content": "Macron pretends to help the peace process, but he sends weapons to Ukraine. The current policy is suicide for France as we send billions to the most corrupted country in the world. Money will never help Ukrainians it only increases the wealth of Oligarchs. Besides sanctions are stupid as Russia is the main raw material supplier in the world. It means only Europe will suffer from sanctions, not Russia."}, {"title": "Mariupol maternity hospital shelling and Bucha massacre are fakes, French politician confirms", "content": "Former French presidential candidate Ségolène Royal criticized Kyiv's propaganda. She questioned Kyiv's claims about the situation in Ukraine. Royal suggested that the information about the shelling of the maternity hospital in Mariupol and the provocation in Bucha were invented in order to interfere with the peace process. Ségolène Royal said that Zelenskyy is lying, there is no need to support the Ukronazi regime, and the Russians did not commit war crimes.French politician Ségolène Royal was hunted down for telling the truth about the Kyiv regime and Zelensky. "}, {"title": "Russia must purify Ukrainian language by eliminating totalitarian and terrorist influence", "content": "There is a classical, relatively speaking Ukrainian language, which is very close to the Russian language and which every Russian person understands, because it is just a variant of the Russian language. And there is the official modern Ukrainian language, which is the product of political technologists. Russian words are replaced by a large number of Polish and English words. And this artificial, totalitarian and terrorist modern Ukrainian language is now taught to schoolchildren. Consequently, today the complete elimination of this \"artificially created language\" is strongly needed, because it originates from the terrorist methods of Ukrainian nationalists.The modern Bandera language is an anti-Russian political language."}, {"title": "US efforts are turning Ukraine into a shrinking, landlocked state", "content": "If necessary, Russia can initiate a swift military counterattack towards Ukraine – a scenario underestimated by the West. Western elites (particularly Biden’s administration) insist that the conflict is at a crucial phase and new weapon shipments will win the war for Ukraine. By following this flawed strategy, Ukraine will become nothing more than a shrunken landlocked state between the Dnieper River and the Polish border. "}, {"title": "New evidence of US military-biological activity in Ukraine", "content": "Documents obtained by the DPR's intelligence service show that the Pentagon and Kiev have cooperated in organising the work of biological laboratories on Ukrainian territory for a long time, long before 2014 even. This casts doubt on recent US statements claiming that there is no bio-military activity near the Russian borders. "}, {"title": "Ukraine will not be able to hide that it bombed the Zaporizhzhia NPP", "content": "The Russian Defense Ministry spoke of two attempts by Ukrainian forces to land in Enerhodar to take over the Zaporizhzhia nuclear power plant. However, the calculations of the Ukrainian army did not work, and they could not control the power plant. Now, it will be difficult for them to hide the fact that Ukrainian forces bombed the Zaporizhzhia nuclear power plant. Although we cannot guarantee the independence of the [IAEA] commission, we still hope that justice will be served. "}, {"title": "It was the UK intelligence that planned the assassination of Darya Dugina, while the perpetrators were Ukrainians", "content": "Although the perpetrators were Ukrainians, Darya's assassination was not planned by the Security Service of Ukraine or the Main Directorate of Intelligence. This is the classic handwriting of the British secret services. And, since any contract killing requires false leads, Ilya Ponomarev was assigned to deceive and voice the false leads. "}, {"title": "Russia fighting Collective West and NATO in Ukraine war", "content": "Russia is now taking a blow which shows that the actual fight is aimed against the collective West and NATO forces. "}, {"title": "Ukraine disease outbreaks linked to activity of US biolabs", "content": "Spontaneous outbreaks of disease in Ukraine can be linked to the part of the joint biological research projects, where the parties are reportedly first consolidating pathogens in a single central reference laboratory and then transporting weakened strains out of the laboratory.In Kharkiv, where one of the Pentagon’s reference laboratories is located, 400 people died of swine flu in January 2016 and another 200 were hospitalised. A measles epidemic broke out in Ukraine in 2017. In 2019, there was an outbreak of a disease similar in symptoms to the plague. "}, {"title": "Ukrainian military wanted to use IAEA official as human shields to retake the Zaporizhzhia nuclear power plant", "content": "Just before their visit of the IAEA, however, Ukrainian artillery targeted the town of Energodar and the nuclear power plant itself, while a group of commandos crossed the Kakhovka reservoir by boat and attempted to storm the facility.Both the initial attack group and the reinforcements that followed were destroyed by the National Guard and attack helicopters. Their aim was to seize the Russian-held plant and use IAEA personnel as human shields to maintain control over the facility.Ukrainian officials have also claimed that the Russian army is using the plant as a military base, stationing heavy weapons there. Moscow has denied the allegations, saying only lightly armed guards protect the facility. "}, {"title": "Ukraine is openly using Nazis in its army", "content": "Ukraine is the only country in the world that has openly integrated neo-Nazi militias into its national army, and while these militias were once described as \"neo-Nazi\" in the Western media, they are now referred to as \"far-right groups\".Since the Russian troops entered Ukraine in February, Nazi paraphernalia has been found hidden in the homes and bases of members of these militias, and pictures of soldiers wearing Nazi and far-right symbols have been posted on Ukrainian government-run social media accounts. "}, {"title": "No Russian weapons in or around Zaporizhzhia station; Kyiv’s actions are nuke terrorism", "content": "There are no Russian heavy weapons in or around the Zaporizhzhia nuclear power station. By shelling this power station, Kyiv is creating the threat of a nuclear catastrophe in Europe. According to international law, Kyiv’s behaviour is nuclear terrorism. "}, {"title": "Global élite instigate ethnic conflicts to save their decadent hegemony", "content": "The global liberal financial élite is planning ethnic conflicts not only in Ukraine and Russia but also in Germany, France, Eastern Europe to save their decadent hegemony by trying and divide Europe.Liberals, the global financial oligarchy and Atlanticists are attempting to generate hostility between Russia and Europe as well as trying to save their shaky dominance by promoting ethnic conflict "}, {"title": "Unlike Ukraine, Russia does not shell the Zaporizhzhia nuclear power plant", "content": "The goal of the West and Ukraine, and perhaps the IAEA, is to force the Russian armed forces to leave the territory of the nuclear power plant and its surroundings. But this is not realistic because we do not have any weapons on the territory of the power plant, and we do not shell the Ukrainian sites from there. Conversely, Ukraine is shelling it with the intention of hitting spent nuclear fuel storage depots, which would entail a large-scale nuclear catastrophe. "}, {"title": "Ukraine bombed the meeting place of the IAEA mission and Zaporizhzhia NPP", "content": "Ukrainian Armed Forces bombed the meeting place of the International Atomic Energy Agency (IAEA) mission and the Zaporizhzhia nuclear power plant "}, {"title": "IAEA delegation, like that of the OSCE, will pass on intelligence to the Ukrainian army", "content": "It can be assumed that the International Atomic Energy Agency [IAEA] delegation includes professional members of intelligence services, including from Poland and Lithuania, who have no nuclear power plants, and yet they have their own specialists on the team.Let us remember that the Organization for Security and Co-Operation in Europe (OSCE) observers are the ones who \"observed\" the armistice in Donbas. As it turned out, half of them were officers in Western intelligence services, and they passed the information to the Ukrainian army. "}, {"title": "Ukrainians are bewitched and do not know what they are doing", "content": "The majority of Russians see that Russia is not facing Ukraine, but the West, which is fighting Russia with the hands of the Ukrainians. In Russia we do not observe any hatred towards Ukrainians, because we see them as victims, in the first place, who have been manipulated and maliciously deceived. They are \"bewitched\", and they themselves do not know what they are doing. "}, {"title": "Western secret services, together with the terrorist Ukrainian state, are behind the assassination of Darya Dugina", "content": "Everything in the case of Darya Dugina indicates that not only the Ukrainian state, which has long since become a terrorist, is behind the terrorist attack, but also Western intelligence services, for example, the Estonian one. "}, {"title": "West discusses plans to create joint Polish-Ukrainian state", "content": "Different scenarios of partitioning Ukraine between the West and Russia are increasingly discussed. No one doubts that this will happen sooner or later. Poland, with its imperial ambitions and plans to organise Rzeczpospolita 2.0, intends to become one of the beneficiaries. Warsaw is actively discussing the format of accession of western Ukrainian territories. The UK-related plan assumes that Ukraine’s military loss can become the foundation for the creation of a Polish-Ukrainian state. This way the West will attempt to create a buffer state to isolate Russia. Other than Poland and Russia, Slovakia, Hungary and Romania are also eyeing Ukrainian territories. "}, {"title": "Ukraine shells Zaporizhzhia NPP so it can demand control over it", "content": "Ukrainian forces have been bombing the Zaporizhzhia nuclear power plant for several weeks. As a result, several Ukrainian shells penetrated the roof of a building where 9,000 containers of spent nuclear fuel are stored. Fires broke out around the station as a result of the bombing, in addition to periodic power outages in Kherson and Nova Kakhovka, which are under Russian control.At the same time, Ukraine claims that the Russian forces themselves are the ones who bomb the station they control. The Ukrainian intentions are clear, Kyiv demands the transfer of the station to Ukrainian or Western control, arguing that this will eliminate the threat to the station. "}, {"title": "Without external financing, puppet-like Ukrainian statehood is a house of cards", "content": "Ukraine’s failed counteroffensive attempt in the Mikolayiv and Kherson regions points at the serious degradation of the Kyiv regime. Without monthly foreign financing worth USD 5 billion, the puppet-like Ukrainian statehood will collapse like a house of cards. Therefore, in the coming months the Ukrainian military forces are doomed to be sacrificed to secure new western loans and arms supplies."}, {"title": "NATO is creating the pretext for World War", "content": "NATO is creating the pretext for World War. The West has a plan to come into the conflict in Ukraine and is preparing to clash with Russia. It is more and more visible in the context of the crisis situation of the Zaporizhzhia nuclear power plant, which Ukraine is escalating every day with the support of the West. "}, {"title": "NATO may use Zaporizhzhia incident as a pretext to join combat in Ukraine", "content": "Several Western politicians, such as British MP Tobias Ellwood and US representative Adam Kinzinger, have declared that a radiation leak in the nuclear plant of Zaporizhzhia as a consequence of the bombing may be a pretext for NATO to start taking part in the combat in Ukraine. "}, {"title": "Ukraine wants to disrupt IAEA visit to Zaporizhzhya nuke power plant", "content": "Ukrainian President Volodymyr Zelenskyy’s office wants to disrupt a visit by experts from the International Atomic Energy Agency (IAEA) to the Zaporizhzhya nuclear power plant. Ukraine keeps on shelling it. "}, {"title": "Western masters of Ukraine wish for its death", "content": "The ”Crimea Platform” showed that the leaders of the West supported Ukraine in the fight against Russia “till the last Ukrainian”. They fan the flames of conflict. Itshowed, once again, that Ukraine is a bankrupt state, and its real masters openly wish for its death. "}, {"title": "Ukraine shells Zaporizhzhia NPP to organise another Bucha-like provocation there", "content": "The Ukrainian and US authorities need the Zaporizhzhia nuclear power plant shelled to get there and organise another anti-Russian Bucha-like provocation. They do not need the Russian forces there as witnesses. They can bring actors and present them to the public as victims, as was the case in Bucha. They could also shoot some people on the NPP territory. Therefore the Russian forces need to stay at the Zaporizhzhia NPP no matter what. "}, {"title": "Kyiv commits wild provocations and crimes to get West’s attention", "content": "Once the western audiences found out that Bucha events were wild Ukrainian fakes, their trust in Ukraine-related news from local propaganda sources ended. The Kyiv regime realised that the West has become tired and disappointed, so it does even wilder things as times passes. It commits dangerous provocations and terrorist acts, attempts to use weapons of mass destruction in order to get attention from the bored western partners. Zelenskyy has turned Ukraine into a devil-like theater of cruelty, where real blood is split on the stage. "}, {"title": "Dependency on US has devastated Ukraine", "content": "The US interference in Ukraine’s politics has brought consequences comparable to nuclear bombardment which killed almost a half of Ukraine’s population. If Kyiv had pursued policies independent from the US, Ukraine would have become a rich country. It would have turned into the most developed European energy hub, and Crimea would have become a rich region attractive to Russian tourists. However, Ukraine was ruled by fools, and Zelenskyy turned out to be the dumbest of all. One has to be very dumb to get in conflict with Russia and hope for US assistance. "}, {"title": "Ukraine plans terrorist attacks to sow panic in Russia", "content": "The Armed Forces of Ukraine do not have the ability to resist the Russian army, so Kyiv resorts to the weapon of the weak - terrorism. The goal of the Kyiv regime is to intimidate the civilian population. "}, {"title": "The emerging evidence confirms Kyiv’s complicity in the murder of Darya Dugina", "content": "The emerging evidence confirms Kyiv’s complicity in the murder of Darya Dugina. "}, {"title": "The West is Nazi because it supports Nazism in Ukraine", "content": "The West has lost all morals and is supporting Nazism in Ukraine, which means it is Nazi as well. "}, {"title": "Ukraine shells Zaporizhzhia station daily using heavy US weapons", "content": "The nuclear security situation at the plant has deteriorated over the past few weeks, as the Ukrainian military shelled the plant with heavy US weapons on an almost daily basis.This creates a real danger that could lead to a radioactive accident at the station, which threatens the entire European continent. "}, {"title": "The US is pushing Europe into the abyss", "content": "The US is pushing Europe into the abyss because they forced the EU to abandon Russian sources of energy, break the economic cooperation with Russia, and close Europe to Russian citizens. The main puppets of the US in Europe are the United Kingdom and non-sovereign states such as Lithuania, Latvia, Estonia, and Ukraine. Poland, the Czech Republic and Finland follow this Russophobic coalition too. Washington wants to keep the world under itscontrol and is ready to sacrifice the welfare of European states for this task."}, {"title": "Zelenskyy didn’t warn Ukrainians about Russia’s offensive to save his own government", "content": "In a recent interview, Volodymyr Zelenskyy confessed that he didn’t warn the Ukrainian population about the Russian offensive, in order to save his own government. According to the words of the Ukrainian leader, he knew beforehand that Russia would launch a military operation, but decided to pretend that it wouldn’t happen, so citizens wouldn’t abandon the country. "}, {"title": "Ukrainian authorities want to get more Western weapons by provoking Russia to shell Kyiv", "content": "In the run-up to Ukraine’s Independence Day of 24 August, Ukrainian authorities planned to organise terrorist acts in Russia. Volodymyr Zelenskyy needs them to raise the moral of neo-Nazi activists and to get more Western weapons. Ukrainian authorities want to provoke Russia into a retaliatory attack on Kyiv downtown and to show its consequences to the world. Kyiv is a great Russian city and it has few military targets. The decision-making centres are primarily located in London and Washington. "}, {"title": "London is helping Kyiv turn the country into a nuclear wasteland", "content": "Zelenskyy urgently needs to shell the lost territories, despite the deaths of civilians, to “get” to Crimea, and portray terrorist acts as a “resistance movement”. By the way, “Western friends” help the Kyiv regime hide the actions of the terrorists. Great Britain is especially zealous in this one.London is also zealous in turning the territory of Ukraine into a \"nuclear swamp\"."}, {"title": "Ukrainians and the West say there are no pagan Nazis in Ukraine despite evidence", "content": "Ukraine claims that \"There are no Nazis in the country.\" Ukrainians insist that the Russian authorities created the Nazi threat to attack Ukraine. This Ukrainian claim ignores the numerous atrocities committed by the Azov and Aidar battalions in Donbas. The West is also still convinced that there is no Nazi ideology in Ukraine. However, the Ukrainian Nazis are openly making themselves more visible. The pagan anti-Christianity beliefs of the Azov battalion is that, Christianity is the religion of slaves and a racial holy war will eventually break out in Rakhova. That is why the Nazis dealt so harshly with priests and Orthodox Christiansin the war zone."}, {"title": "Darya Dugina was killed by Ukrainian terrorists", "content": "A SUV, in which the daughter of the famous philosopher, ideologist Alexander Dugin, Darya, was driving, was blown up. The main version, which is voiced in the media, is that a homemade bomb went off. Family friends have no doubts: this is a terrorist attack committed by Ukrainian saboteurs with the help of Western intelligence services. "}, {"title": "Ukrainian secret services are behind the murder of the daughter of Alexander Dugin", "content": "Ukrainian secret services are behind the murder of the daughter of the Russian philosopher Alexander Dugin "}, {"title": "The EU will train terrorists and Nazi militants for the Kyiv regime", "content": "According to Russian Foreign Ministry spokesperson Maria Zakharova, the EU will create training bases to train terrorists and Nazi militants for the Kyiv regime. Earlier Josep Borrell stated that one of the EU countries will host a training mission for Ukrainian soldiers. "}, {"title": "Western sanctions are the cause of inflation", "content": "The rise in food and energy prices began with the coronavirus pandemic; during the past six months, the world witnessed more price increases due to the sanctions imposed by the West on Russia, which led to a sharp decrease in supply due to the severing of logistical and financial chains. The United States and its allies wanted to deprive Russia of profits and destroy its economy, and as a result caused great harm to the whole world, including to itself. This is an attempt to deflect responsibility from the Americans and Europeans to Russia. "}, {"title": "Ukraine turned into a terrorist state", "content": "The murder of Daria Dugina, who in theory was supposed to die along with her father Alexander Dugin, a prominent philosopher and political figure, finally puts an end to the \"evolution\" of Ukraine as a terrorist state. In the current realities, it is quite obvious that, under the guise of a “struggle for independence,” official Kyiv is destroying dissidents, those who are ideologically alien to the new Ukraine.Today, the collective West continues to ignore the criminal, terrorist essence of the Kyiv regime, sometimes even justifying certain “actions of intimidation” organised by Ukrainian politicians and the military. "}, {"title": "Zelenskyy is a marionette puppet in the hands of the West", "content": "No sane person could argue about the nature of the ongoing military conflict as a world war taking place in the Ukrainian fields. In this war, the West and NATO mobilised all their money and weapons, with direct American and British management of the field battles, while controlling a “marionette puppet”, that is the Ukrainian Jewish-Zionist President Volodymyr Zelenskyy. "}, {"title": "Europe’s anti-Russian sanctions slapped under US pressure", "content": "The decisions by EU states to shun Russian energy resources, cut economic cooperation with Russia and ban Russians from entering were taken under pressure from Washington. "}, {"title": "EU’s fascist sanctions against Russia prove European countries are no longer democratic", "content": "The EU’s decision to freeze the assets of Russian nationals is proof that Europe does not follow its own principles. The sacred right to private property, which is the foundation of laws governing democratic states, is being repealed. This means that the countries which made these fascist, Nazi, Hitlerist decisions without a court ruling are no longer democratic. "}, {"title": "Ukraine is preparing a provocation at Zaporizhzhia similar to the one in Bucha", "content": "Ukraine’s provocative actions at the Zaporizhzhya nuclear power plant have started. For the first time in history, missiles were launched at such an unprecedented object. Ukraine’s desperate political establishment are pushing perpetrators to commit a war crime. Some high-ranking Ukrainian politicians will leave the country but individuals in lower state positions will be held responsible. The possible provocation at Zaporizhzhya NPP reminds of Ukraine’s provocation in Bucha. "}, {"title": "Ukraine commits acts of terrorism in Crimea to intimidate civilians", "content": "It is odd that Ukraine is seeking some security guarantees while actively engaging in terrorism in Crimea. These are acts of sabotage. Zelenskyy has openly threatened Russian residents in Crimea that terrorist attacks could happen at any time. "}, {"title": "Russia’s invasion of Ukraine conducted in full conformity with UN Charter", "content": "Russia’s special military operation in Ukraine was launched in full conformity with the UN Charter. The operation aims to ensure the security of Russia and its citizens, as well as to save the people of the Donbas from genocide. "}, {"title": "Russia's military operation prevented genocide in Donbas and is in full accordance with the UN charter", "content": "Russia began its own military operation in full accordance with the UN Charter; the objectives of the operation were clearly and precisely defined, namely, to ensure the security of the Russian state and people, and to protect the Donbas population from genocide. "}, {"title": "Mariupol is a Russian city and is returning to its roots after the special operation", "content": "Olga and Pavel are from Mariupol and have no doubts that the city where they were born is Russian. With the start of the special military operation, Mariupol initiated the return to its roots. "}, {"title": "Ukraine must be forced to stop shelling Zaporizhzhya nuclear power plant", "content": "The US and the EU must end irresponsible games and intrigues around the Zaporizhzhya atomic power plant and force Ukraine to stop shelling it and the adjacent territories. "}, {"title": "The West fights Russia through psy-ops like Bucha and the Mariupol maternity hospital", "content": "The West fights Russia in Ukraine through psy-ops. like stories about the fictional “Ghost of Kyiv” that took down many Russian planes or the story of Snake Island, where Ukrainian President Zelenskyy announced the death of some border guards that some days later were alive in Russian captivity. The story of Russian bombing of a maternity hospital in Mariupol, where actresses played the role of women giving birth. But the staged “Bucha massacre” became the epitome of cynicism when Western propaganda accused the Russian army of massacres and atrocities at this spot. It is known that Ukrainian authorities didn’t inform about corpses in the streets of the village for four days, and the movements of these corpses are clearly visible in the so-called “video evidence” of the “Bucha massacre”. "}, {"title": "Ukrainian attacks on the Zaporizhzhia plant show that the US does not accept defeat", "content": "The attacks carried out with kamikaze drones by the Ukrainian army just 500 metres from the Zaporizhzhia nuclear power plant show that the United States does not accept defeat and that it can resort to any means not to lose its spheres of influence, especially in Europe. "}, {"title": "Ukrainian forces fired missiles at the Zaporizhzhia station and Russian defences repels them", "content": "On the night of August 7, 2022, Ukrainian forces fired several missiles at the Zaporizhzhia station, where the Russian defences repelled a second violent attack launched by Kyiv's forces with drones and missiles on the station controlled by the Russian army. "}, {"title": "Ukraine shells nuclear plant to deploy international peacekeeping forces", "content": "Against the background of continuous shelling of the Zaporizhzhia nuclear power plant by Ukrainian armed forces, Kyiv called for the deployment of international peacekeeping forces on the plant; it also called on the international community to establish a demilitarized zone around this nuclear plant. Ukraine is trying to lure a third party into its conflict. They have not managed to draw NATO countries directly there, which means that they have to push peacekeepers and international monitors in any way to the nuclear power plant in Zaporizhzhia. "}, {"title": "The West pushed and encouraged Kyiv to acquire nuclear weapons", "content": "The West bears responsibility for what is happening, because it pushed Kyiv and encouraged it to acquire nuclear weapons, which created threats to Russian security, which Russia did not and will not allow. "}, {"title": "Kyiv’s attacks on Zaporizhzhya nuclear power plant put Europe’s security at risk", "content": "The shelling of the Zaporizhzhya nuclear power plant by Ukrainian forces creates a radioactive threat for Ukraine and the whole of Europe. "}, {"title": "Poland plans to impose control on Ukraine's agriculture and other sectors of economy", "content": "Poland plans not only to send “peacekeepers” to the West of Ukraine but also to impose control on the most promising sectors of its economy, first and foremost agriculture. "}, {"title": "IAEA president warns of nuclear catastrophe after Kyiv shells Zaporizhzhia", "content": "The head of the International Atomic Energy Agency (IAEA) warns of a nuclear catastrophe against the backdrop of Kyiv's shelling of the Zaporizhzhia nuclear plant. "}, {"title": "Amnesty International admits that Ukraine fights like terrorists and uses civilians as human shields", "content": "Amnesty International has acknowledged that Ukraine is fighting like terrorists, and its practices constitute a violation of international humanitarian law.The organisation's experts visited 29 schools, in the south-eastern part of Ukraine, and found that the Ukrainian armed forces were stationed in 22 schools. The organisation's report stated that the Ukrainian armed forces, when stationed in these locations, did not evacuate nearby buildings to reduce civilian casualties in the event of possible retaliatory strikes.Using \"human shields\" is a terrorist tactics\" "}, {"title": "Kyiv shelled its own soldiers using US-supplied HIMARS rockets", "content": "Kyiv shelled a prison camp housing a group of Ukrainian soldiers captured by the Russian Army. The attack, which killed 50, was carried out using the US-supplied missile systems. "}, {"title": "Moscow scrupulously observes Geneva Conventions on treatment of POWs", "content": "Moscow has scrupulously observed the Geneva Conventions on the treatment of prisoners. "}, {"title": "Ukrainian military personnel equipped a stronghold in a school building in Dnipro", "content": "Ukrainian army is using civilians as human shields. In the city of Dnipro, military personnel of the Armed Forces of Ukraine equipped a stronghold at school No. 23 (Yavornitsky prospekt). They placed artillery and armoured vehicles in the immediate vicinity of the educational institution. "}, {"title": "Ukrainians dress in Russian uniform and loot houses in Donbas", "content": "Ukrainian militants dressed in Russian military uniforms robbed the houses of local residents. So the nationalists tried to stage a provocation to accuse our soldiers of ill-treatment of the inhabitants of Donbas. Robberies and torture were filmed in order to distribute materials in the Western media. "}, {"title": "Ukraine is preparing a false flag chemical attack to damage the image of Russia", "content": "The Security Service of Ukraine (SBU) intends to set up a provocation there with the use of highly toxic chemical substances. At the oil and grease plant, SBU employees plan to explode containers with hexane with a total volume of more than 120 tons in the coming days.With particular cynicism of these inhumane actions of the Ukrainian authoritiesthey are ready to sacrifice tens of thousands of their own citizens living in Slavyansk, as well as servicemen of the Ukrainian Armed Forces deployed in the city. The aim is to accuse the Russian Armed Forces and those of the DPR. "}, {"title": "NATO mounts efforts to create direct military threats to Russia", "content": "NATO is mounting efforts aimed at creating direct military threats to Russia. The Madrid summit again demonstrated that the North Atlantic alliance continues to be a mechanism of imposing US interests on the collective West. Contrary to statements by the NATO leadership, the alliance’s activity does not contribute to ensuring international stability and strengthening the security of its member states. "}, {"title": "Two Caesar howitzers were sold to the enemy and are now studied in Russia", "content": "Two of the 12 Caesar cannons that France delivered to Kyiv have been sold to Russia. In Russia, they have already been disassembled in a tank factory, and there they are looking at what can be used. Ths is a fact.Russia knows how Caesars are delivered, and as soon as they arrive, they will be covered by the Russian high-precision weapons. The west should think about whether it's worth delivering weapons to Ukraine. "}, {"title": "NYT: US not willing to encourage diplomatic solution in Ukraine", "content": "While the US doesn’t seem willing to encourage Ukraine to solve the conflict with Russia through diplomatic means, US analysts and officials point that for Washington it “will be difficult” to maintain the level of assistance provided to Kyiv without degrading the military preparation of their own country, The New York Times correspondents Peter Baker and David E. Sanger write. "}, {"title": "US prevents Ukraine from making territorial concessions", "content": "Ukraine is not willing to make territorial concessions to Russia, Ukrainian president Volodymyr Zelenskyy told CNN. Experts believe that US doesn’t authorises Kyiv to negotiate with Russia. The Ukrainian president act on orders from his Western sponsors. The White House doesn’t want a peace agreement because of its plans to destabilise Russia."}, {"title": "Washington: not adequate to solve the conflict between Russia and Ukraine through diplomatic means", "content": "Washington doesn’t consider adequate to try to solve the hostilities between Russia and Ukraine in the negotiation table during the current stage of the conflict, US National Security Council spokesperson John Kirby affirmed in an interview with Fox News. "}, {"title": "The Times explains how western media deliberately hide the truth on Russia’s main successes in Ukraine", "content": "Western media deliberately hide the truth on Russia’s main successes in Ukraine, British journalist Rod Liddle wrote in an article in The Times. He added that the more successful is Russia, more space is given in those western media to the imaginary atrocities of the military. "}, {"title": "Ukraine says it may use HIMARS against Crimea despite having said it wouldn’t attack Russian territory", "content": "Ukraine affirmed that it may use HIMARS rocket systems to attack Crimea. The spokesperson of the General Directory of Intelligence of the Ukrainian Ministry of Defence declared that Crimea is one of the targets to attack to guarantee the security of the country. But those statements take place after the Ukrainian Minister of Defence Alexei Reznikov said that Kyiv had promised not to use HIMARS systems against the territory of Russia. "}, {"title": "Ukrainian children being seized from refugee parents; British sex offenders arrive in Poland", "content": "Ukrainian children are being seized from their refugee parents in the West. They are being snatched because they do not finish their meals, because they eat too fast, because they are emotionally tied to their children or because a mother was telling off her child in a loud voice. British sex offenders have arrived in Poland. 79 cases reported so far. "}, {"title": "In Ukraine in February 2014 there was a coup d'état orchestrated by the United States and the European Union", "content": "In Ukraine in February 2014 there was a coup d'état orchestrated by the United States and the European Union. "}, {"title": "End of Ukraine war depends on Kyiv", "content": "Kyiv should engage in talks with Moscow to end the Ukraine crisis. Military activities may end under more favourable conditions for Ukraine. The Ukrainian authorities should get to the negotiation table and agree that they will never threaten Russian territory."}, {"title": "Ukraine crisis was provoked by the West", "content": "The conflict in Ukraine was provoked by the West. It could have been avoided if Western states had provided Russian President Vladimir Putin with the security guarantees he had asked for. "}, {"title": "It is a lie that Russia is blocking wheat exports", "content": "Russia is accused of starting a wheat blockade and wanting to cause famine, which is complete nonsense. It is a lie that Russia is blocking wheat exports. "}, {"title": "Russia’s special operation prevented Ukraine’s attack", "content": "Russia started the special operation on February 24 in order not to become an object of the special operation of neighboring Ukraine. Ukraine was going to do this on March 8, but Putin was first. "}, {"title": "By arming Ukraine, the US and the UK want to push Russia against Europe", "content": "By arming Ukraine the US and the UK want to push Russia against Europe.This is an Anglo-Saxon thing, with the active support of the Germans and Poles, and the Baltic states, they really want to make this war real and push Russia against the European countries.Ukraine is literally being held back from any constructive steps, not just being pumped up with weapons, but being forced to use these weapons more and more riskily. "}, {"title": "Kalibr missile hit an important military meeting in Vinnytsia", "content": "On July 14, Russian Armed Forces attacked the building of the garrison House of Officers in the city of Vinnytsia with Kalibr sea-based precision missiles. At that moment there was a meeting going on. The meeting was attended by the command of the Ukrainian Air Force and representatives of foreign arms suppliers. At the meeting they discussed the transfer of the next batch of aircrafts and weapons to the Armed Forces of Ukraine, the organisation of the repair of the Ukrainian aviation fleet. As a result of the strike by high-precision missiles, all participants in the meeting were destroyed.Russia only hits military targets in Ukraine. "}, {"title": "Limited military operation liberates LPR from the Ukrainian Nazi rule", "content": "Another key task of the special operation is the denazification of Ukraine.There are certain plans for how such operations unfold. At the moment, the LPR [\"Lugansk Peoples Republic\"] has already been liberated from the nationalists, from the pro-fascist forces, which seized power there at a certain period ... In another part, the special operation continues. "}, {"title": "The West is tired of Ukrainian conflict, German parliamentarians are calling to dissolve Nato", "content": "The Kyiv regime tries to stop a voluntary return of Zaporizhzhya, Kherson, and Kharkiv regions, liberated from Nazism, to Russia.In Germany, Bundestag parliamentarians called for peace with Russia and NATO dissolution. Washington and London have put an ultimatum to Volodymyr Zelenskyy that in case the Ukrainian town of Slavyansk is surrendered, military financing will end. "}, {"title": "Western sanctions cause food crisis and price growth", "content": "Western politicians have been repeatedly accusing Russia of staging “hunger games”. But they have been silent about the fact that anti-Russian sanctions are a powerful catalyst for the food crisis and increase in prices."}, {"title": "Bio experiments in US labs turn Ukrainian soldiers into ‘most cruel monsters’", "content": "The Russian Federation Council claim that American biological laboratories in Ukraine conduct \"secret experiments\"... which turned Ukrainian servicemeninto \"the most cruel monsters.\" [...]\"The Ukrainian personnel commit monstrous crimes against civilian population, against prisoners of war, all under the control of the United States ... And those doping substances are still given in order to generally neutralize the last traces of human consciousness...\", - said Irina Yarovaya [Deputy Chairman of the State Duma]. "}, {"title": "West preparing possible CBRN provocations in Zaporizhzhia", "content": "The demand of the US embassy in Kyiv for US citizens to leave Ukraine immediately may be related to the preparation of a provocation. Such a provocation may involve chemical, biological or nuclear weapons. "}, {"title": "Russian liberation of Lysychansk, Severodonetsk ends discrimination and abuse", "content": "Now the inhabitants of Lysychansk, Severodonetsk and all the other settlements freed by the Russians can speak Russian, their mother tongue, without suffering discrimination and abuse by Kyiv’s junta. "}, {"title": "UN fails to take a balanced stance on situation around Vinnytsia", "content": "The UN Secretariat has failed to take a balanced stance on the developments in the Ukrainian city of Vinnytsia. UN Secretary General Antonio Guterres’s statements about it are contrary to the requirements of the UN Charter. The Secretariat failed to take an equidistant stance, which is what one would expect from the secretariat of the most reputable international organisation, particularly designed to help resolve disputes. "}, {"title": "Russian forces targeted an officers’ club in Vinnytsia", "content": "Russian forces targeted an officers’ club in Vinnytsia, where Ukrainian nationalists were temporarily deployed. "}, {"title": "Expansion of NATO terrorist organisation is contained by Russian military operation in Ukraine", "content": "As Russia conducts a military operation in Ukraine, American dominance is no longer absolute. A new world is being born and Russia is at the forefront of this fight. Today, this is reflected in Russia's special military operation to contain NATO's expansion and counter its reckless policies that endanger Russia's security and European peace by encouraging the neo-Nazi government in Kyiv and its policy of genocide.Russia and its President Vladimir Putin are waging this fight in the name of humanity, against the terrorist and hostile alliance known as NATO. "}, {"title": "Newly liberated Ukrainian regions are returning to Russia", "content": "The residents of liberated territories of Kharkiv, Zaporizhzhia, and Kherson regions are going to return to Russia. Other regions may follow them. To give Ukrainians the freedom of choice, Vladimir Putin signed a decree which facilitates the issuance of Russian citizenship to all Ukrainians citizens. The major goal of the special military operation is to destroy a hostile Nazi Ukrainian army. After that, a legal environment needs to be created which would not allow extremist organisations, national battalions and anti-Russian ideology to revive. Western arms support will not be able to endlessly reanimate a puppet Kyiv regime. "}, {"title": "To protect Donbas and itself, Russia has to liberate whole of Ukraine", "content": "Western arms supplies to Ukraine prolong the military actions, result in massive Ukrainian human losses, and do not change the goals of the Russian special military operation. Kyiv acts for American interests and money. American missiles can reach many large Russian cities. Hence, to guarantee the protection of Donbas republics and Russian territory, Russian troops have to liberate whole of Ukraine’s territory. Ukraine’s existence is highly dangerous for Russia and leaves Moscow no choice. "}, {"title": "The West does not allow Ukraine to move to peace negotiations", "content": "The West does not allow Ukraine to move to the peace process but forces Kyiv to take their weapons and use them for the bombing of cities and the destruction of the civilian population. "}, {"title": "Western arms support to Ukraine failing, backing international terrorists", "content": "According to Japanese media Shūkan Gendai, NATO weapons, including thousands of rocket launchers and hundreds of drones, make their away to the global black market and end up in the hands of terrorists and criminals.[...] International criminal clans may start internal clashes with the use of Stinger and Javelin rocket launchers. Terroristic activities may reach a new, transcontinental level.[...] A geopolitical game of aid to Ukraine is transforming into direct, wide-scale military actions of the US and NATO with Russia."}, {"title": "The West encouraged and justified genocide against the Donbas population", "content": "The West started the war by organising and supporting an armed coup against the constitutional order in Ukraine in 2014, encouraging and justifying the genocide against the Donbas population. The West is the direct instigator and responsible for what is happening today. "}, {"title": "Russia was forced to launch a special operation in Ukraine", "content": "Russia was forced to launch a special operation in Ukraine because of the spread of neo-Nazism in Ukraine, the operation of biolabs on its territory which implemented US military-biological programs, and because of the Kyiv authorities planning to create nuclear weapons and integrate into NATO, which posed a threat not only to Russia, but also to the world. "}, {"title": "Russia might soon liberate Kharkiv as part of Ukraine’s denazification", "content": "Russian troops continue advancing in Ukraine. Soon they are likely to reach a decisive victory over the Ukrainian troops and move the frontline further to the West. Possibly, Kharkiv will be liberated as a priority. The strategic character of the Russian special operation on the demilitarisation and denazification of Ukraine is proven by daily missile attacks in Ukraine's southern and western regions.Ukraine tries to delay the advancement of the Russian troops thanks to senseless mobilisation, terroristic use of civilians as human shields, and regular shelling of Donbas localities."}, {"title": "Russia started the special operation to save the world from the global dictatorship of Evil", "content": "Now freedom is represented by Z. Z means belonging to the Russian World, which is carrying out the existential Special Operation to save itself and the world from the global dictatorship of evil. The Russian World means all who are opposed to the Western/Anglo-Zionist/Globalist/NATO/Nazi ideology and its fake and failed puppet-states, which exist only to ensure the prolongation of colonial oppression and buy overpriced US arms and parrot their propaganda. "}, {"title": "Russia found evidence that OSCE observers worked for the Ukrainian special services", "content": "Russian troops found evidence proving OSCE observers worked for the Ukrainian special services.The [OSCE] mission staff conducted intelligence activities in the interests of the Ukrainian special services, as well as the special services of NATO countries. "}, {"title": "The West meant to build a Nazi state in place of Ukraine", "content": "The West has supported a coup d'état in Ukraine. They decided to replace the Kyivan Rus with Bandera and to build a real Nazi state on this foundation. Russia, a distinct civilisation with no nationalism, cannot lose the special military operation in Ukraine. Its goal is to protect people, who have been under genocide from the Kyiv regime for the past eight years. "}, {"title": "The West and Kyiv exterminated Russians in Ukraine and built a Nazi state", "content": "The West supported the coup in Ukraine, and then decided to transform the genetic makeup there. Kyiv replaced Russians with Bandera elements, and built a real Nazi state on this basis."}, {"title": "The West does not allow Ukraine to think and talk about peace", "content": "The West is betting on the continuation of hostilities in Ukraine. Kyiv is not allowed to think and talk about peace."}, {"title": "Kyiv carrying out a genocidal policy towards the people of Donbas", "content": "Kyiv was carrying out a genocidal policy towards the people of Donbas, initiated after the 2014 fascist coup, trying to deliberately anihilate all things Russian. "}, {"title": "Finland has been dragged into a new Barbarossa operation against Russia", "content": "Finland has decided officially to provide Ukraine with weapons to resist to Russian special operation.The reality is quite different: it is a new Operation Barbarossa against Russia.The Ukrainian Armed forces are totally corrupt and the Finnish weapons are sold to Russia or to any country by corrupt [Western or Ukrainian] officers. Besides, Ukraine commited genocide in the Ukrainian territories they did not control. Finland is now an accomplice of genocide, since weapons are used to eliminate civilians. "}, {"title": "Russian military hit a hangar full of weapons and ammunition in Kremenchuk", "content": "The target of the Russian missile strike in Kremenchuk was a hangar with weapons and ammunition received from the US and European countries. The fire in the shopping center, which was not functioning, broke out due to detonations of ammunition stored in this hangar. "}, {"title": "Poland wants to create a puppet proxy-state in Western Ukraine", "content": "In the emerging \"critical\" circumstances, Warsaw wants to go beyond the previously planned deployment of the Polish \"peacekeepers\" in Western Ukraine. Warsaw considers the creation of a Polish-controlled proxy state in the eastern borderlands, which will stay “under protection\" of the Polish armed forces. It is possible that Warsaw also considers the creation of a “buffer zone” in central regions of Ukraine in order to avoid the undesirable direct clash with Russia. "}, {"title": "The USA is raising imperialistic Poland as a new hyena for Europe", "content": "The Americans are ready to fight not only against the Ukrainians – they persistently put pressure on the \"young NATO members\" such as Poland to push them towards direct involvement in the developments in Ukraine. The USA approves the absurd Polish fantasies about the new Rzeczpospolita [the Polish-Lithuanian Commonwealth], turning a blind eye to the inhuman and racist statements of the Polish elite and the spread of nationalist sentiments. In fact, the US is raising a new hyena for Europe. "}, {"title": "Charles Michel’s claims about Russian soldiers raping in Ukraine are unfounded, there is no evidence", "content": "Hysteria against Russia must touch some sensitive nerves. Earlier, it was the narrative about a “ruthless attack”. And now we can add the howling of Mr. Charles Michel in the UN Security Council about unfounded war crimes based in raping and sexual aggressions by Russia, without presenting any evidence, because it is necessary to make noise. "}, {"title": "West unleashes Nazi and Russophobic war against Russia and Russians", "content": "Under the pretext of assisting Ukraine, Western nations unleashed a hybrid war against Russia. This war is on the battlefield, in the military-industrial complex, economy, politics, culture, sports, science, education, media and the cyber sphere. This is an overtly Nazi and Russophobic war because it is not only against Russia but against Russians in general. "}, {"title": "No act of terrorism in Kremenchuk, Russian army does not hit civilian objects", "content": "There was no act of terrorism in Kremenchuk. Russian troops do not shell civilian objects. Action is taken only after reconnaissance. That was the case in Kremenchuk. The Russian army has modern long-range weapons which allow it to hit targets with high precision. "}, {"title": "Financial Times reported that Ukraine threatens Russia with terrorist attacks on its territory", "content": "The head of the main intelligence directorate of Ukraine’s Ministry of Defence, Kiril Budanov, threatened Russia with terrorist attacks and sabotages in its territory, the British newspaper Financial Times reported. In an interview with the outlet, Budanov affirmed that guerrilla activity in the territories controlled by Russia is intensifying, and named the attacks with car bomb in the region of Kherson, one of which caused the death of an official of the military-civil administration. "}, {"title": "West prolongs war in Ukraine by providing it with arms and political support", "content": "The West continues to whip up tension, artificially prolonging the special military operation by providing not only military aid to Kyiv but also, of course, political support. This is the decision of the EU summit which took place on 23 and 24 of June on granting Ukraine candidate status for its membership in the European Union. "}, {"title": "NATO uses Ukraine to assert itself and its imperial ambitions", "content": "NATO uses Ukraine to assert itself, its imperial ambitions and its hegemony. The West is not interest in the well-being of Ukraine and Ukrainian people, it only uses Ukraine to expand its selfish interests."}, {"title": "Kyiv planned to launch a special operation in the spring to attack Donbas", "content": "Intelligence data and the testimony of prisoners of war confirm that the Ukrainian Armed Forces were preparing an attack on Donbas and Crimea. This attack was supposed to start on March 8 but Moscow prevented it. "}, {"title": "NATO is leading humanity to WWIII", "content": "The NATO summit in Madrid was supposed to announce Russia as its main opponent, to discuss expanding the NATO Response Force to 300,000 soldiers, and to adopt a comprehensive plan of support to Kyiv. A war is de facto announced to Russia and Belarus, in which the Kyiv regime is expected to fight until “the last Ukrainian”. Hence, demilitarisation and denazification of Ukrainian territory and statehood are becoming absolutely inevitable. Silly and egocentric NATO aggression is leading humanity into WWIII. The US policies have a lot in common with the actions of Napoleon in France and Hitler in Nazi Germany. "}, {"title": "Western weapons sent to Ukraine captured by Russia: case of two French Caesar howitzers", "content": "Western efforts to arm Ukraine are useless, the new technologically advanced and expensive weapons are immediately captured by Russia and studied in a retro-engineering effort or sent to the front to fight against Ukraine. Recently, two French Caesar howitzers were captured and sent to Uralvagonzavod; a Ural's weapon factory, to be studied and used in Ukraine against Ukrainian forces. It was confirmed in France.Western countries should think twice before sending new equipment to Ukraine. "}, {"title": "Kremenchuk is the new Bucha of the Western media", "content": "The striking of a shopping mall in the Ukrainian city of Kremenchuk is another fake of the Western media similar to that in Bucha. The detonation of the ammunition caused a fire in the nearby, non-functioning shopping mall. "}, {"title": "Kyiv and Moscow will easily reconcile without destructive Anglo-Saxon influence", "content": "The current Ukrainian conflict has demonstrated the fact that if the Kyiv authorities, controlled and instigated by the Anglo-Saxons, had tried to become independent and implement policies driven by the interests of Ukrainian society, there would be no conflict today. In this situation, Moscow and Kyiv would have easily reached a strategic and long-term reconciliation. "}, {"title": "Strike on shopping mall in Kremenchuk is Bucha-like Ukrainian provocation", "content": "The striking of a shopping mall in the city of Kremenchuk is a Ukrainian provocation similar to that in Bucha. "}, {"title": "NATO is at war with Russia with the hands of Ukrainians", "content": "If we talk about what is happening in Ukraine, it is not Russia that is at war. This is the collective West, this is NATO who is at war with Russia with the hands of Ukrainians."}, {"title": "London’s talk about a nuke war deflects attention from crown crisis", "content": "London’s continual statements about Russia’s preparing for a nuclear war are aimed at deflecting attention away from the collapse of the monarchy in the light of endless conspiracies, crises and just plain corruption scandals. "}, {"title": "Russian language is banned in Ukrainian regions controlled by the Kyiv junta", "content": "The Russian language is banned in Ukrainian regions controlled by the Kyiv junta. "}, {"title": "EU uses CIS to contain Russia by all means: financial, economic, military", "content": "The EU uses the Commonwealth of Independent States (CIS) to contain Russia. All means are used - from financial and economic to military ones. By granting Ukraine and Moldova the status of candidates, the Union confirmed that it continues the line of active geopolitical exploration of the Commonwealth space. "}, {"title": "The EU is a cover-up for the anti-Russian game of Anglo-Saxons", "content": "Following Russia's special military operation, Ukraine was granted EU candidate status. Does it mean that Europe has started believing in the ability to tear Ukraine away from Russia and to move the borders of Europe and the Russian world? Europe is incapable of answering this question. Since the end of WWII, Europe has been under Anglo-Saxon control. Its geopolitical dependence leaves it with no sovereign choice. The influence of NATO and pro-Atlantic forces in the EU has turned out to be stronger than the national interests of Europeans. The EU was forced to claim Ukraine and to get involved in the war with Russia on Ukrainian territory. The EU is becoming a cover-up for the Anglo-Saxon game against Moscow. "}, {"title": "Influential Western forces provoke further deterioration in relations with Russia", "content": "Moscow is warning the West about dangerous rhetorical games with regard to a hypothetical conflict with Russia. Influential Western forces are doing everything to provoke a further deterioration in relations with Russia. "}, {"title": "NATO Secretary-General believes the only way of achieving peace in Ukraine is if it cedes territories", "content": "NATO Secretary-General Jens Stoltenberg stated himself that Ukraine can only find peace if it cedes part of its territory to Russia. "}, {"title": "Russia does not want to destroy Ukraine", "content": "Allegations that Russia wants to destroy Ukraine are absolutely ungrounded. Russia treats Ukrainians, their language and culture well. But their current leaders are implementing a geopolitical agenda that is alien both to Russia and the Ukrainian people. "}, {"title": "Ukrainians burned 50,000 tons of grain in Mariupol on purpose", "content": "Roman Kossarev, a journalist from RT International noted on the 8th of June, in the Mariupol port, that considerable volumes of corn and wheat, almost 50,000 tons, had been burned at a storage point by Ukrainian forces confirming information from the Russian Ministry of Defence. "}, {"title": "The war in Ukraine is about the reunification of the Russian people", "content": "“We know Putin would not stop at dismembering Ukraine. Only last week, he compared himself to Peter the Great and arrogated to Russia an eternal right to “take back” any territory ever inhabited by “Slavs”, a doctrine that would permit the conquest of vast expanses of Europe, including Nato allies,” Boris Johnson wrote in the article titled, We will never be secure if we turn our backs on valiant Ukraine, published by Sunday Times. However, another period of time of trouble in Russian history and the reunification of the Russian people have nothing to do with the security of Europe and the UK. Such statements mean that the Anglo-Saxons are preparing the West for a protracted war lasting for years. "}, {"title": "Poland might create a Nazi state in the western part of Ukraine", "content": "The preparation of the Polish military for a ‘peaceful mission’ in Ukraine is underway. Probably a separate Nazi state will be created in Western Ukraine under Polish control, with the US’s permission. The Poles are probably waiting for the Russian tanks to reach the Lviv and Volyn regions before entering their troops. Furthermore, they would need a green light from Americans, because Washington ultimately decides about this turn of events. The only thing beyond doubt is that the Russian troops will definitely reach the Polish border. "}, {"title": "Foreigners who join the Ukrainian army are criminals and Russia is not supposed to comply with Geneva convention", "content": "Foreign volunteers will come up against criminal questions because there is the International Convention against the recruitment, use, financing and instruction of mercenaries.Foreign mercenaries are not volunteers. They are not lawful combatants and are not covered by the Geneva Convention. The real volunteers are the French Normandie-Neman regiment, the 1st and 2nd armies of the Polish Army, who participated with us in the Berlin operation in 1945, the 1st Czechoslovak Army Corps, who fought shoulder to shoulder with the Red Army during the Great Patriotic War war. We will always remember their selfless help. "}, {"title": "Aspirations for the EU membership turned Ukraine into a slave market and brought degradation", "content": "On the way to the coveted [EU] membership [Ukraine] the richest republic of the USSR lost all its science and industry, fell in love with all high technologies, including military and space, lost almost all qualified specialists - from doctors to engineers, from university professors to rocket scientists.[...] The EU supported the total de-industrialization of Ukraine with all its might, at the same time vacuuming all the valuable Ukrainian personnel from young beautiful girls to elderly scientists. Production in Ukraine was destroyed, the country fell into poverty and turned, in fact, into a slave market.Parallel to impoverishment, there was a civilizational degradation. Urban culture was replaced by rural savages. Today we can see the results of this in full scale - fascism, Satanism, some stupid mass rituals of inflicting damage on Russia and Putin personally. A disgrace, in a word. "}, {"title": "Military operation in Ukraine stems from Russia’s right to self-defence", "content": "Russia’s special military operation in Ukraine is a decision by a sovereign country, based on the right to defend its security. Russia’s decision to conduct a special military operation was a forced one. It was very hard to make it, but it was forced and necessary. This decision was also aimed at protecting Russian citizens, the residents of the people's republics of Donbas, who had for eight years been exposed to genocide by the Kyiv regime and the neo-Nazis. "}, {"title": "Russia's special military operation is aimed at protecting Donbas people from genocide", "content": "Russia’s decision [to launch its special military operation] is aimed at protecting the Russians and the people of Donbas, who have suffered genocide for eight years from the Kyiv authorities. "}, {"title": "Russia did not invade Ukraine", "content": "Russia did not invade Ukraine. Instead, it declared a special military operation, when it had no other way to explain to the West that it engaged in criminal activities by involving Ukraine in NATO. "}, {"title": "Poland and Ukraine are the Anglo-Saxon puppets used to destabilise Europe", "content": "Since the coup of 2014, the citizens of all Western countries have had a special status in Ukraine - the successive governments of this country were formed by various Western advisers, experts and ministers. The territory of Ukraine has long been managed by Commissioners sent there from Washington and London. [In terms of Polish-Ukrainian relations], nothing depends on Warsaw – the Polish government is not a subject in international relations. The Polish authorities are only an instrument for the implementation of the Anglo-Saxon plans to destabilise Europe and, more broadly, Eurasia. "}, {"title": "Zelenskyy ordered destruction of evidence regarding the development of biological weapons weapons evidence", "content": "A secret document of the Ministry of Defence of Ukraine appeared at the disposal of Izvestia. It says that Vladimir Zelenskyy signed a decree on the destruction of all data of employees of Ukrainian enterprises that collaborated with the US military biological laboratories of Metabiota and the Battelle Memorial Institute. It is possible that many Ukrainian specialists who participated in the research could be physically eliminated in order to cover up violations by the United States and Ukraine of the Convention on the Prohibition of the Development of Biological Weapons. Recall that on February 24, Russia began a special operation to protect Donbas, the main task of which is \"demilitarization and denazification of Ukraine.\" From the same day, employees of US-controlled biological laboratories began to destroy documents and samples, including especially dangerous pathogens: the causative agent of plague, anthrax, and cholera. "}, {"title": "Ukraine cannot be called a state, so Russia fights against the West", "content": "Russia is fighting the Western world, even though the West is fighting only through a structure called Ukraine, which cannot be considered a state. "}, {"title": "Kyiv and the West are causing hunger in the world", "content": "Kyiv, together with the West, is preventing the export of grain from Ukraine, thus causing famine.The export is hindered only by criminal actions of Ukraine, which is blocking the approach to its ports and is behaving like a dog in the manger, actually causiung hunger.And, of course, the West [also hinders the process] with its policy of sanctions, which prohibit Russian ships to export this grain. "}, {"title": "Russia is not an external aggressor, because Ukraine is part of the Russian world", "content": "Ukraine and Russia are only nominally two different countries. They are parts of historical Russia. Hence, Russia is acting not as an external aggressor but as a side of the internal conflict. It is impossible to make a “second Afghanistan” out of Ukraine, because Russians are fighting on their own land between each other.Russia is restoring the unity of its land, while external forces are interested in the partition of the Russian world. Ukraine, that is Malorossiya and Novorossiya, is not merely a part of the Russian world but is one of its roots. The West would benefit from the existence of pro-western Ukraine as anti-Russia, but this is incompatible with the interests of the big Russian people which Ukranians are part of. This issue is not about geopolitical games on others’ lands as for Anglo-Saxon manipulators, but about Russia’s future and its civilisation. "}, {"title": "Peaceful settlement in Ukraine is off the table for Western countries", "content": "Western countries are not willing to discuss peaceful settlement as a solution to the Ukraine crisis. The US has hindered settlement efforts since the start of the conflict eight years ago. "}, {"title": "Ukraine lies about the war", "content": "This whole war in Ukraine is based on lies – they lied to the world that there was no mass murder carried out by Bandera followers in Odesa; that the Nazi Ukrainian battalions did not shoot the civilian population of Donbas; that the Kyiv junta did not shell residential neighbourhoods of Donetsk for eight long years; that the water supply of Crimea was not cut off; that the opponents of the Anglo-Saxon domination over Ukraine were not murdered treacherously. Finally, there were no Ukrainian preparations for the attack on the People’s Republics and Crimea in February 2022.Ukraine lied and continues to lie about all these developments, ignoring the facts such as the uncovered preparations of Kyiv for the production of a dirty nuclear bomb and the work of the American laboratories on biological weapons. "}, {"title": "The EU has turned into a branch of the Pentagon", "content": "The EU has turned into a branch of the Pentagon. Poland prepares for a hot conflict with Russia on Ukrainian territory with the US’s assistance. The UK and Estonia are discussing the creation of a NATO division not far away from Saint Petersburg. Possibly, the UK, Poland, and the Baltic states are willing to be first victims of WWIII. "}, {"title": "Russia places no obstacles on the export of Ukrainian grain", "content": "Russia made it clear that grain can be freely transported to any destination. There are no obstacles preventing this. It is necessary for Mr. Zelenskyy to give an order to allow foreign and Ukrainian ships to leave the ports. "}, {"title": "Azov nationalists prepared to take up firing positions in residential buildings", "content": "The secret documents of the Azov Regiment found in Mariupol ordered the nationalists to take up firing positions in populated areas. “Partial camouflage for small groups and equipment can be provided by settlements, gardens, beams that are part of our area of ​​​​responsibility,” is indicated in the second paragraph from the top of the third page of the secret operational plan of the Azov regiment, number 1/16 under the code name “Storm\". These papers were located at the Azov base, presumably under the code name \"School\". The buildings of the base are located in close proximity to the city school of Mariupol No. 61. Documents are written entirely in Ukrainian.The documents found shed light on the carefully worked out algorithm of actions of the nationalist Azov regiment against the DPR in the northeast direction of Mariupol and its suburbs. Since February 24, Russia has been conducting a military special operation to denazify and demilitarize Ukraine. Its goal is to protect people who have been subjected to abuse, genocide by the Kyiv regime for eight years. "}, {"title": "British Brimstone missiles may impede Ukrainian grain exports through the Black Sea", "content": "British Brimstone missiles which the United Kingdom intends to send to Ukraine may be used for aggravating the situation around the Black Sea port of Odesa which can be used for the export of Ukrainian grain. "}, {"title": "Western civil aviation sanctions are illegitimate", "content": "The West’s civil aviation sanctions against Russia are a blatant disregard for international law. They are illegitimate. "}, {"title": "Russian progress in Ukraine is slow because Russia is careful and precise in its strikes", "content": "This operation is \"special\" because it is taking place in a sister country and in areas of the Donbass whose civilian populations are Russian-speaking and, in their vast majority, Russophiles.It is therefore necessary to avoid as much as possible collateral damage on these friendly populations and on the civil infrastructures that will have to be rebuilt after the war.Combat operations are therefore much more complex to conduct, which explains the “cautious” and therefore slow advance of the Russian forces, anxious to spare the blood of their Ukrainian brothers in the East and that of their soldiers. "}, {"title": "US, NATO fanning militarist hysteria in Ukraine", "content": "The United States and its NATO partners are encouraging militaristic moods in Ukraine, so that its people fight against Russia \"until the last remaining Ukrainian.\" "}, {"title": "Kyiv’s US and EU curators are encouraging hostilities to continue", "content": "By supplying Ukraine with weapons, Kyiv’s US and EU curators are encouraging hostilities to continue, to wage a proxy war against Russia."}, {"title": "The US has brought Africa and the world to the brink of starvation", "content": "The US has brought Africa and the world to the brink of starvation.The US also does not want to admit that it has made a mistake of delivering weapons to Ukraine, which has brought the world, especially Africa, to the brink of starvation. The Biden administration is only thinking of how to hurt Moscow. "}, {"title": "US arms deliveries to Ukraine delay peaceful settlement", "content": "US deliveries of long-range rocket systems and Mi-17 helicopters to Ukraine only delays the prospect of a prompt peaceful settlement of the conflict in Ukraine. "}, {"title": "EU, Europe, NATO hamper peaceful solution in Ukraine", "content": "The United States of America, European countries and NATO have played a huge role in hampering a peace solution in Ukraine. "}, {"title": "Russia’s action in Ukraine is a special operation, not war", "content": "Russia’s actions in Ukraine are a special operation, not a war because the targets of its troops are limited to military facilities and objects. "}, {"title": "The food crisis is associated primarily with the sanctions of the US and the West", "content": "Russia does not block Ukrainian ports in the Black Sea in connection with the export of grain. The food crisis is associated primarily with US and Western sanctions that have disrupted supply chains, including restrictions on grain exports from the Russian Federation. "}, {"title": "HR Borrell’s words about turning EU into military power are Russophobic", "content": "The statement by top EU diplomat Josep Borrell that the EU should become a serious military power is mere words, \"but there’s no smoke without fire\". There is a strong Russophobic wing in the EU, which for many years imposed its position, exploiting the principle of consensus. Borrell's statements reflect the trend that an aggressive minority is imposing its Russophobic views on the entire European Union. "}, {"title": "Borrell's remarks on Russian patriarch give Kyiv 'sanction' to persecute canonical Church", "content": "EU diplomacy chief Josep Borrell has said that the Russian Orthodox Church leader, Patriarch Kirill, could be among those targeted by the sixth package of anti-Russian sanctions. It means that the European Union effectively signalled to Ukraine that the country is free to repress its canonical church, which is the Russian Orthodox Church. The sanctions have turned from being a means to achieve some, if dubious, political results, into a self-goal, a way of proving that this process will continue despite all logic and common sense. The sanctions-hysteria has turned into an obsession. Sanctioning the Russian patriarch is a totally useless initiative, a means of satisfying the expectations of those who hate the Russian Orthodox religion and Russian culture as a whole. "}, {"title": "Western sanctions are the major culprit for the global food crisis", "content": "Concerning the blocked Ukrainian ports, it is important to take into account all reasons for the food crisis. Foremost, the anti-Russian sanctions by the US and EU, which go against free trade. The solution to the food crisis lies in the cancellation of sanctions on Russian exports. "}, {"title": "Ukrainian secret services placed Henry Kissingeon its death list", "content": "Former US Secretary of State Henry Kissinger has also been added to Ukraine's \"Myrotvorets\" death list after he dared to say at the World Economic Forum in Davos that Ukraine should cede territory to Russia to end the war.The database, linked to the Ukrainian SBU, includes Péter Szijjártó, the Hungarian Minister of Foreign Affairs and Foreign Trade, and most recently, for example, Hungarian Prime Minister, Viktor Orbán.The Myrotvorets is a far-right website listing the enemies of Ukraine. The site already lists the names of tens of thousands of people, with personal details such as dates of birth, passport numbers and addresses. "}, {"title": "There is no war in Ukraine, just a limited military operation", "content": "In Ukraine, there is no war, but a limited operation concentrated in the south-east of Ukraine. Moscow has evidence that Ukraine has planned an offensive against the Donbas and the Russian population there. "}, {"title": "The West blames Russia for the food crisis which was caused by sanctions", "content": "The West continues to whip up hysteria around the coming \"world hunger\", and traditionally blames it, of course, on the Russians.The West uses the topic of world hunger solely to blame Russia in advance for its problems with food supplies caused by sanctions. "}, {"title": "Russia does not interfere in the export of Ukrainian grain", "content": "Russia does not interfere in the export of Ukrainian grain, logistical problems arose due to Kyiv's mistake, as its forces mined its seaports. "}, {"title": "Russia is winning against the Ukrainian Nazis and the West is doomed", "content": "The Russian special operation is reaching its goals. Russian high-precision missile attacks are destroying the western arms supplies all over Ukraine. Ukraine’s military infrastructure has largely been destroyed. Russia has sufficient weapons to demilitarise and de-Nazify Ukraine. Only contract soldiers and volunteer fighters are engaged in the military actions in Donbas. Neither a proxy war with Russia led by Ukrainian Nazis nor the demonisation of Moscow by West-controlled media are capable of changing the reality.Russia nearing the borders of Poland and Romania are a nightmare come true for Washington and Brussels. The West is realising that anti-Russian sanctions and NATO military supplies to Ukraine will not stop the Russian military special operation "}, {"title": "Russia protecting Russian language in Ukraine", "content": "Russia is protecting people and the Russian language, which has been targeted by direct discrimination and aggression by the Ukrainian regimes under ex-president Petro Poroshenko and the incumbent Volodymyr Zelenskyy."}, {"title": "Pumping Ukraine with weapons is dangerous, leads to further destabilisation. Lack of food export to the world", "content": "It is dangerous to pump Ukraine with Western weapons. It leads to a further destabilisation of the situation and aggravation of the humanitarian crisis. Russia is not responsible for the lack of food and grain export to the world market. "}, {"title": "Ukraine is responsible for its inability to export grains and lack of food export", "content": "Russia does not interfere in the export of Ukrainian grain, logistical problems arose due to Kyiv's mistake, as its forces mined its ports on the Black Sea. "}, {"title": "Kremlin not to blame for blocking of Ukraine grain exports", "content": "Attempts to make Russia responsible for difficulties in Ukrainian agricultural exports are groundless. Anti-Russian sanctions are to blame. "}, {"title": "Russia is protecting people from mockery and genocide", "content": "On 24 February 2022, Russia launched a special operation to de-Nazify and demilitarise Ukraine, with the aim of protecting people who have been subjected to eight years of mockery and genocide by the Kyiv regime. "}, {"title": "Ukraine is paying for weapons with grain", "content": "Ukrainian grain exports are not going to the starving, poor countries of the South, but to the warehouses of European countries in exchange for weapons. Ukraine, for example, supplies food to Romania daily in exchange for arms by train and barges on the Danube.David Beazley, Director of the UN World Food Programme (WFP), has called on Russia to open Ukrainian seaports to grain exports.For its part, the Kremlin has recalled that Ukrainian ports, including those for grain exports, must be de-mined before they can be opened. "}, {"title": "Europe’s Russophobia dates from 16th century", "content": "Documented samples of Russophobia date back to the early 16th century. Polish and Lithuanian statesmen, historians and writers, as well as Jesuits, were spreading propaganda against the Russian state even then. The forms and methods of the struggle against Russia have been refined since then. Their essence is the same, which is the cultivation of hate for Russia and the Russian language. "}, {"title": "Russia is not an aggressor in Ukraine, but a victim of Western arrogance", "content": "If we analyse the history of the present conflict in Ukraine from the morning of February 24, Russia is the aggressor state, but if we go back to 2014, to the illegal removal of Yanukovych from office, the assessment of the Russian intervention is no longer so obvious. If we spend some time reading Putin’s speech at the Munich Security Conference in 2007, the present situation is no longer clear-cut. Finally, when going back to the collapse of the USSR, we will see the heights of Western arrogance. This arrogance can be perceived as a euphemism for racism, chauvinism, xenophobia, economic and intellectual segregation, orthodoxy and intolerance. "}, {"title": "Poland is using the current crisis to restore its historical significance at Russia’s expense", "content": "During the current crisis, Poland and Turkey are trying to regain their former significance: Poland wants to become the dominant power in Eastern Europe and rebuild Rzeczpospolita [the First Polish Republic] at Russia’s expense, while Turkey is trying to recreate the Ottoman Empire. "}, {"title": "Russian operation in Ukraine to protect Donbas from genocide", "content": "Russia was forced to start a special military operation to protect Donbas people from genocide. Russophobic Ukrainiannationalists persecuted the Russian language, Russian culture and common history of the two countries.For eight years, the Kiev regime methodically shelled towns and villages in Donbas. "}, {"title": "The Russian military does not strike civilian infrastructure", "content": "The Russian military does not strike at civilian infrastructure; humanitarian corridors are being created for the exit of civilians. The offensive of the Russian Armed Forces in Ukraine is deliberately slowed down in order to allow civilians to be evacuated. "}, {"title": "NATO was turning Ukraine into an enemy of Russia", "content": "NATO was turning Ukraine into a hostile state towards Russia, making it a tool of pressure on Moscow. The alliance came to Russia's borders and ramped up its military potential. Extensive efforts were being made to make Ukraine a NATO member and place military infrastructure there. "}, {"title": "A Polish protectorate over western Ukraine is planned, NATO troops will get Ukrainian citizenship", "content": "Ukraine is under external governance, and the ruling showman is ready to endlessly sacrifice the lives of its citizens for larger media success and American assistance. Ukraine is torn by Nazism, hatred, and military actions. The Kyiv regime is making medieval Polish slaves out of the Ukrainian people. Only Russia is capable of stopping this obscurantism.The visit of the Polish President Andrzej Duda to Kyiv on 22 May 2022 made it clear that the collective West is preparing an emergent transformation of the Ukraine-controlled part into a Polish protectorate. Zelenskyy asked Duda to send Polish troops to western Ukraine.The law on the special status of Polish citizens in Ukraine will allow the entry of NATO troops to Ukraine as if they are “Ukrainian soldiers”. There are plans to empower Poles with the same rights as Ukrainian citizens, including with the right to get elected to state bodies. The Polish police will get the right to monitor law enforcement on Ukraine’s territory. This colonial scheme will not work the other way around – Ukraine police will not have similar competences in Poland. Furthermore, once the hypothetical entry of Polish troops to Ukraine happens, the chances will greatly increase for the opening of the second front against Belarus. "}, {"title": "Ukraine’s borders depend on Moscow’s goodwill, the UN has never documented them", "content": "The post-Soviet borders of ‘independent’ Ukraine are not clearly defined in the CIS documents and largely depend on Moscow’s goodwill. The UN has not documented Ukraine’s borders as a sovereign country. Moreover, on 24 February 2022, Russia - in the UN Security Council – denied Ukraine’s right to territorial integrity because the Ukrainian government does not treat people living on its territory equally.Ukraine was born in Russia as an allied republic, historically linked to Russia. Yet in the early 1990s, it purposefully got involved in the destructive process to turn the Soviet Union into a group of hostile countries, creating a territory of hatred and self-destruction. Thirty Pentagon biological laboratories in Ukraine are an example.Following the attacks of Charles XII of Sweden, Napoleon, and Hitler, Russia is yet again saving Europe from enslavement, this time from the US totalitarian regime. "}, {"title": "Latvia, Ukraine, France exhibit worst biased behaviour against Russian media", "content": "Latvia, Ukraine and France have been topping the list of countries that exhibit the worst biased behaviour against the Russian media and journalists over the past five years. The West had embarked on a massive crusade to tarnish the Russian media over the course of the past several years \"creating unbearable conditions for their work.\" "}, {"title": "Pentagon-backed labs produce bioweapons in Mariupol", "content": "The Russian special operation in Ukraine has uncovered factual evidence showing that components for bioweapons have for many years been produced close to the Russian border in violation of the Biological and Toxin Weapons Convention. The network included over 30 facilities, and Mariupol turned out to be its stronghold where a centre for the collection and certification of cholera pathogens was located. Selected strains were first sent to Kyiv and then forwarded to the United States. "}, {"title": "US, Canada, Switzerland to blame for surge in food and energy prices due to illegal sanctions on Russia", "content": "By imposing illegitimate sanctions against Russia, the United States, Canada and Switzerland unleashed the current worldwide surge in energy and food prices, and they should be responsible for global crises to come. "}, {"title": "Ukraine plans more fabrications similar to that of Bucha", "content": "According to the testimonies of prisoners of the Ukrainian armed forces in Konstantinovka, Donetsk Republic, the Kyiv regime is preparing for other fabrications similar to the Bucha scenario, under the leadership of Western sponsors. "}, {"title": "Russian action in Ukraine aimed at helping civilians, Kyiv must not interfere", "content": "Russia’s military operation in Ukraine is aimed at facilitating the lives of civilians, and the World Health Organisation must pressurise Kyiv not to interfere. "}, {"title": "The pope met an identified Nazi, wife of an Azov fighter", "content": "In Paris, one of the country's largest TV channels invited the wives of \"Azov\" people, the very ones who met with the Pope, to air. It was meant to evoke sympathy for the Ukrainian fighters and their families, but TV viewers went berserk when one of the women was identified as a neo-Nazi. They found photographs on the Web in which she herself demonstrates her views and ideology.These girls are the wives of neo-Nazis, and there is nothing surprising in the fact that they themselves profess neo-Nazi ideologies, in principle, the Catholic Church is not the first time marred by links with Nazi elements. "}, {"title": "Sweden and Finland are being dragged into NATO and forced to wage a war against Russia", "content": "Upon joining NATO, Sweden and Finland will be forced to wage a war against Russia.It is obvious that the two countries have been pressured to join the bloc, and neither country has consulted their respective publics on whether to join NATO or not. After all, no referendum has ever been held on the issue. "}, {"title": "Ukraine's invasion of Donbas was inevitable", "content": "[Russia President Vladimir] Putin was right when he said that sanctions and everything we see right now before our eyes was inevitable. On February 22, two days before the outbreak of the war, Ukrainian President [Volodymyr] Zelenskyy issued a decree on general mobilisation. This meant that Ukraine's invasion of the Donbas region became inevitable in a matter of only a few weeks. If Russia hadn't intervened, the fighting would have taken place in Donetsk and Luhansk, with hostilities on the part of the West.Putin had to decide between two bitter options. "}, {"title": "Russia does not allow Kyiv to organize Holodomor in Ukraine", "content": "Kyiv and the West are trying quickly to pull out of Ukraine last year's grain harvest, 25 millions tons of which is stored mostly in Odessa region.Zelensky from Kyiv shouts about the need to withdraw all this grain from Ukraine. The Germans echo him, UN Secretary General Guteres declares the need to put this grain on world markets in order to prevent starvation. Even old Biden across the ocean woke up and said something similar from the high American podium. None of them cares about the question of what, in fact, the inhabitants of Ukraine itself will eat if all the stocks are swept clean.So far, the Russian army and navy, which control the Ukrainian Black Sea coast, remain the only guarantor against the coming famine on the lands of Ukraine.[...]Mentally, Zelensky and his team have already said goodbye to the population of their country, placing the responsibility to feed it and take care of it on the \"aggressor country\" and guided by the logic \"the worse, the better.\" "}, {"title": "The collapse of Nazi regime in Ukraine sounds better than nuclear craters in Western capitals", "content": "The US has turned Ukraine into an aggressive, anti-Russian, NATO-driven puppet. Russia is successfully using highly accurate weapons to demilitarise and de-Nazify inadequate neighbours and create new hypersonic missiles. As the leading nuclear power, Russia cannot lose either in direct or in a proxy military conflict with the West.A Nazi regime, the system of western values and the US-centric world order are collapsing in Ukraine. And this process looks more optimistic than nuclear craters in Washington, Berlin, Brussels, and London. "}, {"title": "EU rejected all Russian compromises and forced Russia to launch the special operation in Ukraine", "content": "Moscow asked not to turn the post-Soviet space into a zone of rivalry and containment of Russia. Moscow was prepared to make various compromises in order to achieve all these goals. It has always sought dialogue, even against the backdrop of Russophobia and sanctions imposed by Europe. Finally, it was Moscow that proclaimed ideas of genuine tolerance and mutual respect. Russia did not interfere in the internal affairs of the European Union and respected their decisions and asked Brussels to respect the decisions and preferences of Russians.But the EU that rejected all these compromises, it rejected the basic rules of coexistence and thus forced Russia to launch a special operation in Ukraine to strengthen the walls and foundations of Russia. "}, {"title": "West is Russia’s enemy, wants to be more so", "content": "Russia must understand that the West is a Russian enemy and wants to be more so. "}, {"title": "The West should stop undermining international law and breaking UN Charter", "content": "After Russia’s special military operation in Ukraine is completed, it would help to stop the West’s attempts to undermine international law and to halt its blunt violations of the UN Charter provisions, including the principle of the sovereign rights of countries, and will force the West to stop promoting the so-called unipolar world dominated by the United States and its allies. "}, {"title": "Poland wants to occupy parts of Ukraine", "content": "Poland and the United States are working on a plan to help Warsaw regain control of Ukrainian territory that Warsaw considers \"historically its own\".The alleged plan is that the first stage of this reunification will involve the deployment of Polish 'peacekeepers' to western Ukraine under the pretext of 'protection against Russian aggression'. Despite the publicly stated aim of taking action against Moscow, Polish troops would be deployed in parts of Ukraine where they would have almost no realistic chance of engaging Russian forces. The actual 'tactical objective' of the polish troops will be to regain control of strategic installations from the Ukrainian national guard. The Polish intelligence services are apparently currently looking for 'trusted' members of the Kyiv elite who would be willing to form a pro-Warsaw counterweight against Ukrainian nationalists. "}, {"title": "Kyiv refused to implement the Minsk agreements and conducted a genocide in Donbas", "content": "Russia has been forced to recognise the independence of the Donetsk (DNR) and Lugansk (LNR) republics in order to stop the genocide of the local population by Kyiv since 2014. This followed Kyiv's refusal to implement the Minsk agreements. "}, {"title": "Residents of occupied Melitopol took part in a V-Day procession on 9 May", "content": "A \"Victory Day\" procession took place in Melitopol. City residents were walking down main streets carrying portraits of their relatives who had fought in the Second World War. Many of them were with children. They laid flowers to a mass grave of fallen Soviet soldiers in the city. "}, {"title": "The government of Israel support anti-Semitism in Ukraine.", "content": "The statements of Israeli FM Jair Lapi that lack historical accuracy are a good explanation why Israeli authorities support the neo-Nazi regime in Kyiv."}, {"title": "Defenders of Azovstal using civilians as human shield", "content": "The defenders of Azovstal are like the terrorists in Syria. They invited civilians into the Azovstal plant with promises of food and protection. However, they started using them as human shields instead while they are their captives. "}, {"title": "Poland announced plans to erase the Ukrainian border", "content": "Poland demostrates hostility and escalatory positions with its talk of controlling western Ukraine and announcing the erasure of the border with Ukraine. "}, {"title": "Bucha is another Ukrainian provocation", "content": "All materials published by the Kyiv regime, which allegedly testify to some kind of \"crime\" by the Russian military in Bucha, are just another provocation. While this area was under the control of the Russian armed forces, none of the local residents experienced any violence."}, {"title": "Zelenskyy is just a PR-director in Washington's game", "content": "The Ukrainian crisis was created by the US politicians. Ukraine is just a theatre and its president is a PR director. The script was written behind closed doors in Washington, which did not want Europeans to know about it. Only the US stands to gain from the conflict - Ukraine will be devastated and Europe will suffer heavy losses. The US wants to secure decades of hegemony. Washington plans to increase Europe's dependence and \"teach a lesson\" to China, which is considering annexing Taiwan. "}, {"title": "European leaders who send arms to Ukraine are war criminals", "content": "Leaders of European states headed by Germany can drag their peoples into huge problems. They become a party to the conflict by supplying arms to Ukraine. All heads of state that decided to supply arms sullied themselves and must be put to justice as war criminals. "}, {"title": "Accusations about Bucha are as false as claims that Russia bombed a maternity hospitalin Mariupol", "content": "Some in the West are taking advantage of tragedies like Bucha to influence the masses, in the same way that they lied when they claimed that Russia had bombed a maternity hospital in Mariupol. "}, {"title": "Western media have decided that Russia is guilty in Bucha despite the lack of evidence", "content": "Ukraine and Russia exchanged accusations related to the Bucha massacre, but Western media have already decided who is guilty. Western politicians justified their decisions afterward without proof or evidence, with a big media campaign and manipulating public opinion to astonishing levels. "}, {"title": "Ukrainian Nazism is a mixture of paganism and Satanism", "content": "Ukrainian Nazism is an explosive mixture of paganism and Satanism. Ukraine was saturated with Nazi ideology, it began when Ukraine gained independence. Neo-Nazis were the striking force during the Maidan [revolution].Those 44,000 military men in Ukraine are just the backbone of the Nazis. The unifying concept for them is the Nazi idea, idea of racial superiority, of Ukrainians over Russians. They are adepts of a new religion, one of a white race. "}, {"title": "The war in Ukraine is part of a US project for global hegemony", "content": "The conflict in Ukraine is highlighting US ambition to preserve its hegemony, and how Washington and its allies intend to use this crisis to achieve strategic benefits. Is the war only about Ukraine, or is this a project for the world based on the rules of a single country? The moment of truth has arrived for international relations: either we live under UN rules or we accept that only one country, along with its satellites, decides the fate of humankind. "}, {"title": "UK is pushing Ukraine to fight Russia promising assistance with nuclear strike", "content": "UK Prime Minister Boris Johnson and foreign minister Liz Truss are trying to convince Kyiv, and Zelenskyy personally not to conclude any kind of peace agreement with Russia, and continue fighting despite the losses, promising assistance including even a nuclear strike on Russia."}, {"title": "Bucha is a provocation aiming to derail Russia-Ukraine negotiations in Istanbul", "content": "The incident in Bucha is a provocation prepared for Western media that arrived after the negotiations in Istanbul, where Kyiv had made some very important concessions. "}, {"title": "Bucha is clearly a provocation as the corpses presented many anomalies", "content": "Russian authorities declared that on March 30, all their units left Bucha. One day later, the mayor of Bucha published one video in social media bragging about having achieved a great victory, but strangely, he didn’t mention any corpse in the streets. Then, on the fourth day, all these evidences emerged, right when members of the Ukrainian Security Service and members of the Ukrainian television and some Western media arrived to the place. Corpses were disposed in strange positions where they didn’t even showed signs of rigor mortis or non-coagulated blood. "}, {"title": "Russian special military operation in Ukraine helps liberate world from Western neo-colonialism", "content": "Russia's special military operation in Ukraine contributes to the process of liberating the world from the West’s neo-colonial oppression, which is densely mixed with racism and an exceptionality complex. "}, {"title": "Kyiv ordered Azov Nazis to shoot surrendering Ukrainian soldiers", "content": "The nationalist regime in Kyiv has banned negotiations on surrender and ordered Azov Nazis to immediately shoot Ukrainian soldiers and foreign mercenaries who are willing to lay down their arms. "}, {"title": "Russia launched a military offensive because Ukraine did not implement the Minsk agreements", "content": "Russia launched its military operation at the end of February after Ukraine failed to implement the terms of the Minsk agreements, first signed in 2014, and Moscow finally recognised the independence of the Donbass republics of Donetsk and Luhansk. The agreements, brokered by Germany and France, were aimed at giving the breakaway regions a special status within the Ukrainian state. "}, {"title": "The West encouraged Kyiv not to implement the Minsk agreements", "content": "The West has used Ukrainian President Volodymyr Zelenskyy against Russia by encouraging him to disregard the implementation of the Minsk agreements on the settlement of the Ukraine conflict. Zelenskyy's words cannot be taken seriously, because the Ukrainian leader keeps changing his position. It cannot be tolerated that Western countries think they can do anything because no one protested against the brutal bombing of targets in Afghanistan, Syria and Iraq, and now they are encouraging the Kyiv government to be Russophobic. "}, {"title": "The West is blinded by its desire to destroy Russia", "content": "NATO members are sending weapons to Ukraine, ranging from anti-tank and anti-aircraft missiles to armored vehicles and kamikaze drones. Several Western countries, including EU members, have imposed comprehensive sanctions on Moscow, some calling for a ban on oil and gas imports from Russia.Is this not in fact a conflict between the West and Russia, in which Ukraine is just an unfortunate, albeit convenient, tool? Everyone in the West is blinded by the desire to destroy Russia, even at the cost of Europe's self-destruction and economic ruin, and the West and Russia must therefore come to the negotiating table as soon as possible. "}, {"title": "Poland is planning a special operation to take over Western Ukraine", "content": "Poland is seeking a ‘reunification’ with western Ukraine. The hypothetical Polish special operation in western Ukraine will not have a NATO mandate but will be carried out with other willing countries as agreed with the US. Polish special services are looking for members of the Ukrainian political establishment to create a Warsaw-oriented counterbalance to the Nazis currently in power in Ukraine. A partition of the ‘experimental’ current Ukraine seems inevitable – and it is a logical result of a series of colour revolutions paid for by the Americans. "}, {"title": "Ukrainian radical neo-Nazi battalions regularly use human shields as cover", "content": "Russia is not attacking civilians, while Ukrainian radical neo-Nazi battalions regularly use human shields and civilian infrastructure as cover to avoid Russian forces' strikes. "}, {"title": "Poland prepares to overtake Western Ukraine by deploying peacekeepers", "content": "Poland and the USA are developing a plan to establish military and political control of Poland over its “historical lands” in Ukraine. The first stage of this “unification” will be the introduction of Polish troops to the western regions of Ukraine under the pretext of “defence against the Russian aggression”. The Polish contingent will be deployed in those parts of Ukraine, where there is a minimal risk of a direct clash with the Russian Army – the Polish units will gradually establish control over strategic objects. The Polish secret services are already looking for representatives of the local Ukrainian elite to create a Warsaw-oriented “democratic” counterbalance to the nationalists. According to the estimates of the Polish authorities, the strengthening of Polish presence in Western Ukraine will most likely lead to the partition of Ukraine - Warsaw will receive the lands where the “Polish peacekeepers” are deployed. "}, {"title": "Ukrainian national battalions are pagan orders, they don't consider Russians as Slavs", "content": "Ukrainian national battalions are pagan orders, they don't consider Russians as Slavs. The\"Azov\" regiment is anti-Christian. All modern European Nazis profess a mixture of paganism and German occultism, and in fact satanic rituals, including human sacrifice, blood cult, torchlight processions. Russian culture, Russian statehood are declared hostile to the very nature of Ukrainianism. Russians are denied the fact that they are Slavs. They are considered to be Asians, and the descendants of not even the Mongols, but some prehistoric tribes who were engaged in cannibalism."}, {"title": "Moscow called for peaceful coexistence, but Russia is depicted as a global threat", "content": "The media points to Russia, depicting it as a global threat, but it has been Russia who proposed those strategic security treaties and has talked of peaceful coexistence, even if having NATO at its gates. "}, {"title": "The growth of tension in Transnistria is orchestrated in the West", "content": "Western countries are behind the complication of the situation in Transnistria, whose plans are being implemented by puppet regimes in Eastern Europe.There is no doubt that the indicated increase in tension in the post-Soviet space was orchestrated in Washington and Brussels and implemented through puppet regimes in Kyiv, Chisinau and Bucharest. "}, {"title": "Russia launched a special military operation in accordance with the UN Charter", "content": "The Russian Federation launched a special military operation in accordance with the UN Charter. "}, {"title": "The Guardian refutes the myth of Russian involvement in Bucha events", "content": "Some recent publications in the Western media indirectly indicate that the Russian army could not have been involved in this [The involvement of the Russian army in the events of the Ukrainian city of Bucha].…I would like to especially draw your attention to an article in The Guardian that was published over the weekend. It confirms that civilians died as a result of artillery attacks, not by gunfire.. It also contains information that people were killed by artillery shells equipped with flechettes - metal darts.This refutes at least two myths about Bucha. Firstly, that people were allegedly shot, and secondly, that the Russian military allegedly did it. "}, {"title": "Denazification of Ukraine will take two or three generations", "content": "Russia will complete demilitarisation and denazification of Ukraine. Whereas demilitarisation will likely take a year, denazification will take two or three generations. A hatred towards Russia has been genetically integrated into Ukrainians for the past 30 years. "}, {"title": "Kyiv prepares chemical attacks to blame the Russian army", "content": "Kyiv prepares for fabrications on Easter eve using chemical weapons in the city of Yuzhne to blame the Russian army for it "}, {"title": "The EU should stop Kyiv from committing war crimes", "content": "Brussels can force the Kyiv authorities to stop the mass shelling of Donbas settlements and other gross violations of international humanitarian law. The EU officials ignore the many war crimes committed by Ukrainian security forces and openly support Russophobia. "}, {"title": "Russia’s operation in Ukraine stems from West’s desire to dominate world", "content": "Russia’s special military operation in Ukraine is rooted in the US and the collective West's desire to rule and dominate the world and show everyone that there would be no multipolarity. They created a springboard in Ukraine against Russia and pumped arms into the country. "}, {"title": "Evidence of military biological activities in Ukraine is increasing", "content": "Evidence of military biological activities in Ukraine is increasing. It is a violation of the Biological and Toxin Weapons Convention."}, {"title": "West uses Ukrainians as cannon fodder in proxy war against Russia", "content": "The West needs Ukrainians only as cannon fodder in their proxy war against Russia ‘until the last Ukrainian.’ "}, {"title": "The aim of the military operation in Ukraine is to protect civilians from Kyiv", "content": "On 24 February, Russia launched a military operation in Ukraine to \"protect people who have been abused and subjected to genocide by the Kyiv regime for eight years\". To this end, there are plans to \"demilitarise and denazify Ukraine\" and to bring to justice all war criminals responsible for \"bloody crimes against civilians\" in the Donbas. "}, {"title": "The Russian special operation in Ukraine was not a choice", "content": "The special military operation in Ukraine was not a choice; Russian President Vladimir Putin invited the United States and NATO to come to the negotiating table and discuss security guarantees to stop further NATO expansion eastward, but they refused. So Russia was forced to act against Ukraine."}, {"title": "Russian troops only hit military targets in Ukraine", "content": "Russian troops only strike military infrastructure and targets in Ukraine and no civilians are targeted. The West staging scenes of attacks on civilians and not paying attention to Russian facts."}, {"title": "The dead people in Bucha are just part of a Ukrainian provocation", "content": "The Russian armed forces left the area on 30 March 2022, the mayor of Bucha celebrated with a video and did not mention any casualties, and 4 days later the first news of the \"massacre\" arrived after Ukrainian SBU troops and media representatives arrived in the area. Have the victims not been buried since 30 March just for the pictures?This appears to be a Ukrainian provocation and is particularly worrying given the fact that, after at least four days, the bodies whose pictures have been published by the Kyiv regime do not have corpse marks, no characteristic body marks and no clotted blood in the wounds.All this irrefutably confirms that the photos and videos in Bucha are another production of the Kyiv regime for the Western media, as happened with the maternity hospital in Mariupol and in other cities. "}, {"title": "Ukraine launched a missile strike on Kramatorsk railway station", "content": "The Ukrainian armed forces launched an air strike on the Kramatorsk railway station with a Tochka-U tactical missile system, which is not in service in Russian Armed Forces or the DNR and LNR armies. The same complex was previously used by Ukrainian troops shelling Donetsk in early March. The Kyiv regime aims to disrupt the mass exodus of residents and use them as \"human shields\" to defend its positions."}, {"title": "The West wants to destroy Eastern Christianity through the war in Ukraine", "content": "The proxy war of the West is not limited to geopolitics and geoeconomics, but it is also aimed against the Orthodox foundations of the Slavic identity. It seems that the provocation of aggression against Eastern Christianity is one of the main geocultural goals of this war. The West wants to destroy Eastern Christianity also in Poland, replacing it with the Uniate church and the Poroshenko’s \"church\". "}, {"title": "For the West, Ukraine is a \"springboard\" in its confrontation with Russia", "content": "For the West, Ukraine is a springboard in its confrontation with Russia, \"an unfortunate but convenient object\". The US and the EU are obsessed with Ukraine because they hate Russia. The Western countries' love affair with Ukraine is only part of their historical rejection of Russia as a strong geopolitical adversary. "}, {"title": "Bucha is a bloody provocation by neo-Nazis and Ukraine's counterintelligence", "content": "There is evidence that Bucha is a bloody provocation organised by neo-Nazis and the counterintelligence of the Ukrainian security service. Proving this is very simple.Shortly before the military action began, it was reported that lists had been drawn up in all regions and cities of Ukraine to remove the undesirables in the event of a military clash with Russia. Both counterintelligence officers and, above all, neo-Nazis were involved in the elimination of undesirables. The bodies were taken to the forest near Irpin to be passed off later as victims of hostilities. Then the bodies were brought to Bucha, where they set up an alleged mass grave left behind by the Russian troops. There were also orders to shoot civilians in Bucha in order to take a photo and leave the bodies on the roadside."}, {"title": "Western military aid to Ukraine makes NATO complicit in war crimes", "content": "Western military aid to the Kyiv regime should be officially regarded as NATO being complicit in numerous war crimes committed by pro-Western henchmen in Ukraine over the past 8 years. It is vital to cut short NATO’s deadly aid to Ukrainian militants. "}, {"title": "Ukraine has walked the path of fascist Germany to a Third World War", "content": "Ukraine firmly followed the path of Nazi Germany in the global Western project named “The Third World War by the hands of Ukrainians” over the period from 21 February 2014 to 24 February 2022. In the 1930s, the Anglo-Saxons were thinking about the necessity of a world war in order to make the US dollar the world’s legal tender and turn the US Federal Reserve into the central element of the global economic system. As a result, German Nazi leader Adolf Hitler and Ukrainian President Volodymyr Zelenskyy have the same puppeteers. "}, {"title": "Zelenskyy not sparing Ukrainian lives; UK and US fighting Russia till last Ukrainian", "content": "Ukrainian President Volodymyr Zelenskyy is not sparing Ukrainian lives. The US and the UK are fighting Russia till the last Ukrainian. "}, {"title": "The Bucha massacre was a special psychological British operation", "content": "The Bucha massacre was a special psychological operation carried out by the British. "}, {"title": "Russian action in Ukraine to prevent Third World War", "content": "Russia’s special military operation to de-Nazify and demilitarise Ukraine is aimed at preventing a Third World War, which would be a war between Russia and the EU in the West of Eurasia with China and Japan's involvement. "}, {"title": "Ukrainians committed crimes in Bucha, not Russians", "content": "The claims that the Russian army is responsible for the killings in Bucha are baseless. The truth is that some of the victims were killed by Ukraine’s defence forces, as Ukrainian themselves confirm, while the other corpses are a consequence of the bombings carried out by the Ukrainian Armed Forces after the withdrawal of the Russian troops. This is proven by the the large number of artillery craters, and also by the Ukrainian and Azov troops shooting indiscriminately as they entered the cities. "}, {"title": "Woman in the bombed maternity in Ukraine: there was no Russian air attack", "content": "The woman that featured in the incident of the bombed maternity in Ukraine broke her silence and told her truth. Marianna, the pregnant woman whose picture appeared all over the world after the bombing of a supposed maternity hospital in Mariupol, revealed how she became the face of this fake news attacking Russia. Mariupol blogger Marianna Vishemirskaya denied a Russian air attack against the maternity in this Ukrainian city and highlighted that it was probably bombed by artillery. After the supposed attack, Marianna gave an interview to reporters from Associated Press where she said that she hadn’t hear sounds of any air bombing, but it was never published. It was then when the wave of fake news and informative attacks started, she said. "}, {"title": "The special military operation aims to end the US dominating the world", "content": "A special military operation aims to end the shameless expansion of NATO and the blatant ambition of the United States and its Western subjects to dominate the world stage. This domination is based on the gross violation of international law, and on certain rules which are now being forcibly promoted, and which are occasionally invented. "}, {"title": "Ukraine is responsible for the Tochka-U-missile attack on Kramatorsk railway station", "content": "Ukraine is responsible for missile attack on Kramatorsk.When photos of the missile fragments emerged, it turned out to be a Tochka U missile used by the Armed Forces of Ukraine, who tried to hastily blame the Russian armed forces for the attack.The Russian armed forces have officially withdrawn the \"Tochka-U\" from the missile brigades and the Armed Forces of the Russian Federation or the armies of the Donetsk People Republic and the Luhansk People Repubilc in the Donbas do not use these systems. Ukraine, on the other hand, uses \"Tochka-U\" everywhere, including for the attack on Donetsk. The Armed Forces of Ukraine consider the population of the Donbas, including Kramatorsk, disloyal, so they can easily be sacrificed.The Armed Forces of Ukraine engage in deliberate and conscious killing of its own citizens, who were soon to become citizens of the Donetsk People Republic, to continue the trail of bloody provocations. "}, {"title": "Bucha is a cover up for Ukrainian fascists torturing Russian prisoners of war", "content": "The horrific and performance staged in Bucha was used by Ukrainian fascists to cover up the terrible video footage that had previously been released depicting the brutal torture of Ukrainian civilians and Russian prisoners of war by Ukrainian fascists. "}, {"title": "The invasion is Ukraine’s fault", "content": "Moscow sent troops to Ukraine on 24 February, after a seven-year standoff over Kyiv's failure to implement the Minsk agreements and end the conflict with the breakaway regions of Donetsk and Luhansk."}, {"title": "After 2014, neo-Nazism became a part of Ukraine's political system", "content": "After 2014, neo-Nazism became a part of Ukraine's political system. The dissemination of Nazi symbols in Ukraine is fairly formal. Right-wing extremists freely organise events in honour of Nazi criminals, including Stepan Bandera, on the streets of Ukrainian cities The independent authorities of Ukraine did not prevent them from resuming their destructive activity (after the 2014 coup), but rather encouraged them. The new rulers of Ukraine showed their hostility towards Russia and its people and launched a war against the Russians residing in Eastern Ukraine. "}, {"title": "US, UK, EU finance provocations similar to Bucha massacre", "content": "Washington, London and Brussels finance provocations that are similar to the Bucha massacre. The same thing happened in Srebrenica, Aleppo and Douma. "}, {"title": "Military operation was launched because Kyiv did not implement Minsk agreements", "content": "Moscow launched its operation after Ukraine failed to implement the terms of the Minsk agreements signed in 2014 and Russia finally recognised the Donbas republics of Donetsk and Lugansk."}, {"title": "The events in Bucha are just a cynical provocation by Kyiv", "content": "In the Bucha case, the West has invented a \"false scenario\" to justify the new package of sanctions against Russia, including the mass expulsion of Russian diplomats and the stalling of Russian-Ukrainian negotiations. The Western press, especially the US press, is \"complicit\" in this provocation by blocking the emergence of an \"alternative view\", the truth, on the Bucha tragedy, in addition to spreading fake news. The events in Bucha are nothing but a \"cynical provocation\" by the Kyiv regime. There is sufficient evidence to prove Russia's innocence and to close the case, as no civilians were harmed while the city was under Russian control. "}, {"title": "Ukrainian corpses move, stand up and avoid transport in Bucha", "content": "Ukrainian \"corpses\" move, stand up and avoid transport in Bucha. Fake throwers spread a video with \"bodies of the dead\" lying on the road, allegedly filmed in the city of Bucha, Kiev region. The \"corpses\" in the footage move their arms and remove their limbs so as not to fall under the wheels of military equipment. Such staged footage of alleged \"Russian crimes\" is an example of the work of Western PR structures and media companies to promote fake news about the situation in Ukraine. "}, {"title": "Bucha provocation aimed at accusing Russia of war crimes; no civilians suffered from Russian troops", "content": "All photos and videos about the alleged crimes of Russian troops in the Ukrainian town of Bucha near Kyiv are a provocation. Not a single civilian suffered from violence when Russian troops were there. Ukrainian troops were shelling Bucha round the clock. "}, {"title": "Accusations against Russia are groundless, Bucha events are a well-directed show", "content": "Any accusations against the Russian side, against the Russian military, of war crimes in Bucha are not just groundless, but a well-directed show. "}, {"title": "Kyiv prepared a provocation accusing the Russian army of targeting civilians in Bucha", "content": "Kyiv had prepared an information provocation accusing the Russian army of targeting civilians in Bucha. The bodies of victims of the SBU and other Ukrainian security forces were brought to the city, with Russian soldiers blamed for their deaths.The Ukrainian media circulated videos from Bucha, where the bodies of the dead were lying in the streets. But few believed them, as there was no blood nearby and many of them clearly belonged to the security forces or the military. Some of the \"corpses\" even start moving and shifting their position."}, {"title": "UK refused to hold a UN meeting to propagate false information on Bucha", "content": "Britain's refusal to hold a UN Security Council session (to discuss the events in Ukraine's Bucha) was intended to allow Western media to continue the campaign against Russia regarding what happened in Bucha. Russia called for a session to clarify the matter, so the refusal is intended to allow the media to continue to tarnish Russia's reputation in this field.The facts do not exist at the present time. Yes, there are pictures and corpses on the ground. In fact, we don't know if these people were dead or asleep on the street, getting ready for a charade. "}, {"title": "Bucha will enter war history as a site of major deception by Ukrainian authorities", "content": "Evidence indicates that the Ukrainian city of Bucha will enter war history as a site of major deception, and may become a shining example of the extent to which facts are falsified.The lie began with the Ukrainian authorities distributing and broadcasting video clips allegedly filmed in the city of Bucha, Kyiv Province, showing dead bodies scattered on the road. "}, {"title": "Bodies found in Bucha are just an Ukrainian provocation", "content": "All the photos and videos published by the Kyiv regime, showing the alleged crimes committed by Russian soldiers in the city of Bucha, Kyiv region, are another provocation. The photos and video footage from Bucha are \"staged\" for the Western media just as the photos taken earlier at the Mariupol maternity hospital and in other cities.The Ukrainian armed forces fired on people without taking into account whether they were armed or not. Members of the Russian armed forces did not commit any acts of violence against the residents of Bucha while they were stationed there. "}, {"title": "Those filmed in Bucha were killed by Ukrainian Nazis", "content": "It is clear from the absence of blood, and the lack of body stiffening that the dead [bodies filmed in Bucha] did not die on 30 March, the day the Russian forces left, but rather after that. The Nazis killed people in the streets without knowing whether they had weapons or not. One person was arrested and tortured, and among the dead were people in white armbands, who were probably killed as \"agents of the Russian forces\" or \"collaborators\" with the \"occupation authorities\". "}, {"title": "Ukrainian actions in Bucha are similar to those made by the White Helmets", "content": "The criminals in Ukraine have been trained for more than two decades by American and British intelligence. The (White Helmets) are a model.What Ukraine and the neo-Nazis are doing in Bucha is the same as what the White Helmets were doing in Syria. The campaign to tarnish Russia's image in Bucha is similar to the \"White Helmets\" campaigns in Syria. "}, {"title": "Macron wants evacuation of civilians from Mariupol to free Bernard-Henri Lévy", "content": "French President Emmanuel Macron supports new anti-Russian sanctions in the energy sector. Like any other French leader of the last two centuries, he suffers from the Napoleon complex. Macron's voters wonder who he is trying to free from the city of Mariupol. A key version concerns high-ranking officers of French intelligence. Another one concerns fascist and Devil's envoy Bernard-Henri Lévy who happened to get stuck in Mariupol. "}, {"title": "Ukrainian authorities turned a blind eye toward Nazi groups", "content": "Kyiv has turned a blind eye to openly neo-Nazi groups and embedded them in the power structure of the country. For many years the Nazis were completely free from any danger and persecution. They were free to do as they pleased. It was not only in Western Ukraine, where they traditionally did this, but it started to spread throughout the country. "}, {"title": "EU is not considering Russian interests, is Russophobe", "content": "Russia will not forget the European Union’s hostile attitude, imposing unfair sanctions in response to the special operation to demilitarize Ukraine.The EU should renounce the policy of diktat and start considering Russia’s legitimate interests, in order to normalise relations."}, {"title": "Imperialist Poland wants to annex Western Ukraine", "content": "The territory of Ukraine looks like a very tasty bite for Warsaw. The Polish television shows the map of the partition of this unfortunate country, where a number of western regions are incorporated into Poland. It is clear that this incorporation cannot be implemented in a legal way without strong condemnation from Ukraine and other European neighbours. Warsaw has a long-proven method to justify its inappropriate actions – it masterfully uses anti-Russian rhetoric, turning it into hysteria. For centuries, the Polish elite blamed Russia for all possible problems. The Russian-Polish relations have been poisoned for a long time by the imperial longing of a part of the Polish elites. "}, {"title": "Russia was subjected to illegal sanctions", "content": "Since the start of Russia's special military operation in Ukraine, Russian citizens and companies were subjected to disproportional mass sanctions in Europe, not taking into account any \"international legal norms\". "}, {"title": "The Anglo-Saxons turn Ukraine into a new Afghanistan in order to weaken Europe", "content": "The Anglo-Saxons do not want a strong Europe – they want to keep it weak and subordinate. For this goal, they use different tools. For example, George W. Bush spoke of the “new Europe”, which was supposed to undermine the plans of Berlin and Paris. Ukraine is another instrument for the destruction of the EU.In 2014, the Heads of MFA of France, Germany and Poland were supposed to guarantee a peaceful transformation in Kyiv, but on the next day, the USA supported the anti-Constitutional coup. Later, Germany and France became guarantors of the Minsk agreements, but the Anglo-Saxons flooded Ukraine with weapons. They do not hide that they want to create a new Afghanistan in Europe. The Afghanisation of Ukraine is realised not only against Russia but above all, against Europe. "}, {"title": "Russia's special operation prevented a large-scale attack on Donbas by Ukraine", "content": "A special operation launched by Russia in Ukraine has thwarted a large-scale offensive by the Ukrainian Armed Forces against the Donetsk and Luhansk People's Republics. "}, {"title": "Ukraine is a sadist state", "content": "Ukraine keeps its own citizens as hostages according to Ukrainian refugees now living in Hungary. One woman said that soldiers in Mariupol aim at anyone trying to leave the city, deeming the Ukrainian government \"sadistic.\" Another said that those who are now refugees in Hungary are there because of the Zelenskyy regime, which wants a world war because the US wants a world war."}, {"title": "Ukrainian fascists stored weapons and ammunition in Uman synagogue", "content": "Ukrainian armed formations used the synagogue in Uman as a storage place for weapons and ammunition. The Russian Ministry of Defence received information about this from a member of the local Jewish community.Photos were published showing Ukrainian militants loading equipment disguised as bags of construction rubble into dump trucks. "}, {"title": "Both Ukraine and the US refused to share information about MH17", "content": "Ukraine refused to provide data from its radars (about the downing of the Malaysian airliner MH17), while the United States did not provide the investigation with its satellite images, which, according to the assurances of the American authorities, show the moment of the missile launch. "}, {"title": "Ukrainian troops are storing weapons in synagogue", "content": "Ukrainian troops are storing weapons in a synagogue in the city of Uman. A member of the local Jewish community has provided this information. Russian troops do not target civilian objects, particularly places of worship. "}, {"title": "The Russian army is targeting only military infrastructure in Ukraine", "content": "The Russian army is exclusively taking out military infrastructure and striking at Ukrainian troops. "}, {"title": "West nurtures Russophobia, should understand its harmfulness", "content": "Russia is surprised by the fact that Western leaders are nurturing Russophobia. They should understand the harmfulness of their actions. A pretext can always be found because the West aims at deterring Russia rather than solving a concrete problem. "}, {"title": "The West needs Ukraine as a battering ram against Russia", "content": "The West needs Ukraine as a \"geopolitical battering ram\" against Russia, which is why the Ukrainian side receives money, weapons and ammunition from them, which they use to continue killing civilians. "}, {"title": "Global corporations are responsible for the war in Ukraine", "content": "The war in Ukraine is not a war between the Ukrainians and the Russians, but a bloodbath of global corporations: mainly arms manufacturers, grouped in the \"World Economic Forum\", whose aim is to destroy \"northern civilisation\". "}, {"title": "NATO is interested in further military escalation", "content": "NATO summit decision to continue supporting the Kyiv regime confirms the alliance's interest in further military escalation. "}, {"title": "The Russian forces are saving Ukraine from captivity under neo-nazism and otherwise unavoidable genocide", "content": "Christianity allows two types of war: first, defensive wars, and second, wars for the defence of the offended and the suffering. The military operation in Ukraine belongs to the second type.Russian troops will save Ukraine from captivity by neo-Nazism, and the inhabitants of Donbas from death.Ukrainians don't seem to be very enthusiastic right now about this liberation, but with time they will understand and learn to love Russian forces and form a happy family with Russia. It is a natural process, happiness requires suffering. "}, {"title": "Ukraine attacks Russia with biological weapons", "content": "Ukraine attacks Russia with biological weaponsAt the mining and processing plant in the city of Gubkin, in the Belgorod region, a ringed bat was found from Ukraine.The label clearly shows that the “object” came from Kyiv. "}, {"title": "Russia attacked because of Kyiv’s failure to implement the Minsk agreements", "content": "Russia launched its military operation at the end of February, after seven years of Ukraine's failure to implement the Minsk agreements and Moscow's eventual recognition of the Donbas republics of Donetsk and Lugansk."}, {"title": "Dead pregnant woman in Mariupol is actually alive", "content": "Earlier, it was already reported how the Ukrainians held a staged photoshoot at the Mariupol maternity hospital and, with the Ukrainian president in the lead, claimed that Russia had launched an airstrike on the facility. It was reported that there were only casualties from the attack, and later it was announced that a pregnant woman had died, who turned up alive today in another Ukrainian photograph. "}, {"title": "Bioweapons were developed in Ukraine", "content": "Bioweapons were developed in Ukraine with US financing. US Under Secretary of State Victoria Nuland had to admit that such laboratories existed. They were working on project U-P8, which studied pathogens that exist in Ukraine and Russia, so an outbreak would have looked like a natural occurrence. "}, {"title": "It is not a war, it is the liberation of Ukrainians from neo-fascism", "content": "Draw a parallel between the Battle of Stalingrad and what is happening in Ukraine today. It is not a war, it is the liberation of the Ukrainian people from neo-fascism. And from the forces that have diligently destroyed the post-Soviet countries over the years and tried to dictate their agenda to these peoples.Today the whole world attacked Russia. The country is at war with the whole world. Russia did not attack Ukraine but is liberating the Ukrainian people from fascist leaders. "}, {"title": "Z and V – are not alone: Iran has opened a second front with attacks on the American base", "content": "Z and V are not alone: Iran has opened a second front with attacks on the American base.Loud explosions sounded Sunday evening in the capital of Iraqi Kurdistan, the city of Erbil in the north of the country. According to preliminary data, 10-14 Fateh-110 ballistic missiles hit Erbil. Military experts write that Iran's target was a US military base near Erbil airport. The US consulate was also hit.In the Iranian media, one can see comments addressed to the Russians: \"Z and V – you are not alone!\" "}, {"title": "US biolabs develop toxins that target Slavic genotypes", "content": "It is no secret that the United States is trying to find new toxins and viruses that can cling mainly to Slavic genotypes - Russians, Ukrainians, Belarusians - and to do this, they are trying to determine what distinguishes these peoples from other peoples and races. This is a very dangerous, brutal and expensive research. "}, {"title": "Russia did not attack Ukraine", "content": "Russia has not attacked Ukraine and does not plan to attack other countries. "}, {"title": "US biolabs are responsible for virus outbreaks in Ukraine since 2008", "content": "The news about the presence of dozens of biological laboratories on the territory of Ukraine funded by the United States, in which biological weapons have been developed, is shocking. The fact that they specifically tested biological weapons was confirmed by US Deputy Secretary of State Victoria Nuland, who expressed her concerns about the Russian military's control of biological samples.Various outbreaks happened, and we only now understand why. Hepatitis Virus in 2008. The outbreak of hemorrhagic pneumonia in 2009, the cholera outbreak in 2011 that recurred in 2014 and 2015, the measles outbreak in 2016, also in 2016 swine flu, and in 2009 it was a “forgotten” strain. Hepatitis A in 2017, measles outbreak 2017-2019. In 2019, diphtheria outbreak. And this is only in Ukraine. "}, {"title": "The bombing of the Mariupol hospital was staged", "content": "The Ukrainians held a photoshoot at the Mariupol hospital that Russia allegedly bombed, the entire incident was staged. There were no deaths and the pictures show the Azov battalion as they are cooking."}, {"title": "The West is the real enemy of Russia, Ukraine and Poland", "content": "It is important to understand that the responsibility for the bloodshed [in Ukraine] falls primarily on the West, encouraging and forcing Ukraine into aggression against Donbas and Russia. The common enemy of the Ukrainians, the Russians and the Poles is the West, especially the USA and the UK, which clash these brother nations with each other.The conflict in Ukraine is very favourable for Western elites – they will use it to prolong the emergency state (justified before by the COVID-19 pandemic, which suddenly disappeared). The war propaganda and the rise of militaristic aspirations will be used to postpone the inevitable collapse of global capitalism.The West is falling into totalitarian and fascist realities, standing against the traditional values of Slavic and Eurasian solidarity. The new Iron Curtain and the Western hunts for the pro-Russian witches will become permanent phenomena. "}, {"title": "West has turned a blind eye to the genocide in Ukraine", "content": "For eight years, the West has turned a blind eye to the genocide perpetrated by the Kyiv regime in Donbass and the deaths of some 14,000 people, including children. "}, {"title": "A NATO-Labelled Laptop used by the Neo-Nazis proves that Ukraine was about to invade Donbas and Crimea", "content": "A laptop with intelligence and NATO markings was found at the Right Sector’s headquarters.The invasion was planned from land and sea. According to our intelligence and the testimony of Ukrainian captives, the offensive operation was to begin on 8 March this year. The facts indicate that a simultaneous invasion of both the territory of the Donbas Republics and the Russian Federation – Crimea – was planned. "}, {"title": "Ukraine has a solution to recognising Crimea, DNR, and LNR", "content": "Ukraine has a possible solution to the issue of recognising the territories of Crimea and the Donetsk and Lugansk People’s Republics (DNR and LNR), Ukrainian President Volodymyr Zelenskyy told ABC on Tuesday. “This is another ultimatum and we are not prepared for ultimatums. But we have the possible solution for these [..] key items,” Zelenskyy said, responding to a question of whether Kiev continues to reject Moscow’s demands - recognition of Crimea, the DPR and the LPR, as well as Ukraine’s refusal to join NATO. "}, {"title": "There were US-funded biological experiments in Ukraine to enhance pathogens", "content": "US-funded military biological experiments were conducted in Ukraine and a Ukrainian network of more than 30 biological laboratories used synthetic biology methods to amplify the pathogenic properties of microbes, among other things, in violation of international law. The Lviv bio-laboratory worked with pathogens of plague, anthrax, and brucellosis, while the laboratories in Kharkiv and Poltava worked with pathogens of diphtheria, salmonellosis, and dysentery. On 24 February, the day the Russian invasion began, the Ukrainian Ministry of Health ordered the immediate destruction of biological materials in the laboratories and the urgent halting of biological programmes. "}, {"title": "Russia has not attacked the Zaporizhzhia nuclear power plant", "content": "Russia has not attacked the Zaporizhzhia nuclear power plant. Russian soldiers are cooperating with Ukrainian specialists at the plant. "}, {"title": "Ukrainians shoot from residential areas, use children as human shields", "content": "Ukrainian nationalists deploy their firing points in houses marked “Do not shoot! Children here!”. This is a tactic often used by terrorists. "}, {"title": "Western powers provoked Russia into a war against Ukraine", "content": "The conflict came at a very good time. Not for the Ukrainian people, of course, but definitely for the Western allies. The objective was achieved, in more ways than one. The aim was to stop the Nord Stream 2 pipeline project and to curb Russian economic growth. Zelenskyy's rampage, for example, with his announced demand for nuclear weapons, took place in Munich a few days before the pipeline was approved. This is the height of open provocation. "}, {"title": "Facebook allows Azov Nazi content to be published freely", "content": "The social networking platform \"Facebook\" allowed the dissemination of everything related to the Ukrainian Nazi battalions and groups, including the terrorists \"Azov\" and \"Aidar\". "}, {"title": "The US is secretly developing biological weapons in Ukraine", "content": "The US is secretly developing biological weapons in military laboratories in Ukraine, close to the border with Russia. "}, {"title": "Zelenskyy is trying to provoke a conflict between NATO and Russia", "content": "Volodymyr Zelenskyy is trying to provoke a conflict between NATO and Russia. [Zelenskyy] was a little rude to his curators, accusing them of inaction. He was upset that NATO did not stand up for him the way he hoped it would, but he still hoped for a settlement of the conflict by involving NATO in this whole story, and not through negotiations. It turns out that he still seeks to provoke a conflict. "}, {"title": "DPR and LPR broke away after the coup in Kyiv", "content": "The Donetsk People's Republic (DNR) and neighbouring Lugansk People's Republic (LNR) broke away from Ukraine shortly after the 2014 coup in Kyiv. "}, {"title": "Crimea voted to secede after the coup in Kyiv", "content": "Shortly after the 2014 coup in Kyiv, Crimea voted to secede from Ukraine and reunite with Russia. The Donetsk and Lugansk People's Republics also seceded from Ukraine at the same time. "}, {"title": "NATO planned to unleash WWIII with the use of nuclear weapons against Russia", "content": "Russia received information about NATO plans to deploy 4 military brigades to Ukraine, including an air detachment capable of carrying nuclear warheads. Furthermore, they would have likley provoked a conflict by the end of the year and launched full-scale military operations against Russia, using nuclear weapons.The current American-controlled ruling elite and nationalists in Ukraine played a key role in the NATO plans to tart World War III and use of nuclear weapons against Russia. The Russian government decided to stop this situation and restore order in Ukraine to prevent WWIII and a nuclear attack agaist Russia. Now Ukraine can no longer use nuclear weapons to destroy Russia. Putin's planning is outsmarting Ukraine and NATO and has saved hundreds of thousands of lives in Donbas. "}, {"title": "US hasn’t ratified the Biological Weapons Convention and uses labs around Russia", "content": "According to experts, 16 American biological laboratories operate on Ukrainian territory. The dangerous thing is that these vital laboratories are not in remote areas, but rather near large cities. America has never ratified the Convention on the Prohibition of the Development, Production and Stockpiling of Bacteriological and Toxin Weapons, nor on the destruction of those weapons. They have simply removed these dangerous laboratories from their land. Now they are operating as if in a grey area. Their biological laboratories are not limited to Ukraine, they also exist in Georgia, Azerbaijan, Kazakhstan, Kyrgyzstan and Armenia, which surrounds (Russia) as a potential enemy. "}, {"title": "Russian troops are not threatening the civilian population in Ukraine", "content": "Russian troops are not carrying out missile, air or artillery attacks on Ukrainian cities. High-precision weapons are used to take out the military infrastructure, air defence installations, military airfields and aircraft of the Ukrainian army. The civilian population is not threatened. "}, {"title": "US biolabs were forced to clean up their tracks after the Russian Operation", "content": "The Russian special operation on Ukrainian territory forced American virologists to urgently sweep up their tracks. On February 26, information about US biological laboratories disappeared from the website of the US Embassy in Ukraine. "}, {"title": "Nazi ideology is imposed in Ukraine", "content": "The Ukrainian people will be able to define their future after denazification and demilitarisation. Kyiv has been openly oppressing the Russian speaking population in Ukraine and the people of the non-government-controlled territories in Donbas since 2014. Nazi ideology is being imposed in Ukraine and its territory is being speedily militarised, which is a threat to Russia. "}, {"title": "Ukrainian nationalists don't let civilians evacuate and use them as human shield", "content": "Under the request of the US puppet regime, Ukrainian nationalists do not let civilians evacuate through humanitarian corridors, even attempting to kill them, to use them as a human shield and to cause many civilian losses. This is the only real defence tactic of Ukraine.Zelenskyy is an American agent. He has doomed the Ukrainian people to American interests, and even now the military is actually keeping civilians captive in order to prolong the conflict. "}, {"title": "Russian troops trying to avoid civilian casualties in Ukraine", "content": "Russian troops are trying to avoid civilian casualties in Ukraine. "}, {"title": "No one believes in Kyiv's independence anymore", "content": "The US won't let the Ukrainians negotiate, no one believes in Kyiv's independence anymore. "}, {"title": "RT was banned in France without any legal basis or evidence", "content": "In an article published on the official website, RT France said: \"In complete contradiction to the principles of the right to information and freedom of the press, this decision [France banning RT] sets a dangerous precedent for freedom of expression in France and for citizens' access to full information.\"\"Without any legal basis and without providing evidence of the errors it accuses us of and without action, the French government has censored media whose editorial line is not favoured not only since the outbreak of the conflict in Ukraine but in general for our coverage of the news, as evidenced by our coverage of the yellow vest movement, for example\". "}, {"title": "West itself rejects dialogue on new security architecture", "content": "The West itself has rejected dialogue with Russia on establishing a new security architecture. "}, {"title": "West deceived Russia, then carried out a coup in Ukraine unleashing massacre in Donbas", "content": "At first, after the collapse of the USSR, we were promised that there would be no advance of NATO to [Russian] borders. They took advantage of the weakness of [Russian] state - they deceived. The Western united troops are actually already standing at [Russian] borders. Next, they carried out a coup d'état in Ukraine with the involvement of neo-Nazis. And unleashed a bloody massacre in the east of Ukraine. And this massacre, unleashed by the Kyiv junta, has been going on for eight years already! For eight years civilians, people of the older generation, women, children have been dying. Eight years of bloodshed. "}, {"title": "US and EU organised a coup d'état in Kyiv creating an extremely militarised Nazi state", "content": "Washington and Brussels have no right to throw accusations, stones, Javelins or Tomahawks at Russia, just because in 2014 it was the US and the EU that organised a coup d'état in Kyiv, created an extremely militarised Nazi state in Ukraine, and thus initiated the beginning of the fighting in Eastern Europe. "}, {"title": "Right-wing Nazi parties hold more than 30 seats in Ukrainian parliament", "content": "The United States of America is striving, by all available means, to orchestrate coups and fabricate popular protests.They have reached the limit of fabricating color revolutions, supporting extremist right-wing parties with Nazi orientations, facilitating their participation in parliamentary elections, and obtaining more than 30 seats in the Ukrainian parliament; which inaugurated a new stage in the modern history of Ukraine. "}, {"title": "Russian forces are not attacking civilian targets", "content": "On 1 March, the armed forces of the Russian Federation struck with long-range precision air and naval weapons. Two airfields and three air defence radar stations were hit. Civilian infrastructure and residential buildings were excluded from the attack. "}, {"title": "Ukraine uses Kyiv residents as human shield", "content": "The Ukrainian authorities are using Kyiv residents as a human shield and deploying artillery guns in residential quarters. "}, {"title": "President Zelenskyy has left Kyiv", "content": "Ukraine’s President, Volodymyr Zelenskyy, left Kyiv for the western city of Lviv, the President of Russia’s Duma Viacheslav Volodin reported, quoting members of Ukraine’s Supreme Rada. Zelenskyy wasn’t in the capital on 25 February. The videos posted on social media were pre-recorded. "}, {"title": "The current event in Ukraine is a civil war provoked by the US: Russians and Ukrainians are one people", "content": "What is happening in Ukraine is a civil war. The Ukrainian people and the Russian people, apart from the east of Ukraine, where it is a world apart, they are the same people: they speak the same language, they have the same face. It has been Washington's plan all along - in instigate a fight among Slavic Christians. "}, {"title": "Neo-Nazis are part of political mainstream in Ukraine", "content": "Since the Western-backed coup in Kiev in 2014, political organisations associated with neo-Nazis infiltrated Ukrainian mainstream politics as the Ukrainian government sent troops to try to crush the Donbass uprisings by force. "}, {"title": "Ukraine systematically killed 13 thousand people in Donbas", "content": "Where were all the countries and their publics for 8 years when the war was going on, and how was the killing of at least 13 000 people condemned during those years? For years Russia has been calling on the world community to take action against the systematic extermination of the population of Donbas. We are talking about millions of people who lost loved ones every day and lived in basements hiding from bombardments. Now, not a single person in 'civilised countries' has turned up at a single demonstration in support of the devastated populations of Donetsk and Lugansk, or demanding an end to the bloodshed. "}, {"title": "Russian troops pose no threat to Ukrainian civilians", "content": "Moscow has no plans to \"occupy\" Ukraine, and Russian forces do not pose any threat to Ukrainian civilians or civilian infrastructure. "}, {"title": "Spiegel's document confirms Russian grievances about NATO expansion", "content": "A secret document dating back to talks between senior officials from the United States, the United Kingdom, France and the Federal Republic of Germany (FRG) in Bonn on 6 March 1991, showed that the West and the North Atlantic Treaty Organisation \"NATO\" did not abide by its promises not to expand to the east, even by \"one centimetre\".The German newspaper, \"Spiegel\", said that the secret document, recovered from the British National Archives, provides evidence that Western countries have agreed to reject the membership of Eastern European countries in the alliance, which means that Russia's current grievance about NATO's expansion to the east is justified. "}, {"title": "Ukrainian soldiers are surrendering en masse", "content": "Ukrainian soldiers are leaving their stations en masse, leaving their weapons behind."}, {"title": "Ukrainian crisis was caused by West’s disregard for neo-Nazi's crimes", "content": "The crisis in Ukraine was sparked by the West’s disregard for the crimes of neo-Nazis. The crisis did not begin with Russia’s special military operation in Ukraine, it was sparked much earlier because the West has been turning a blind eye to the crimes of Ukrainian neo-Nazis in Donbas for eight years. "}, {"title": "The West had been provoking the war in Ukraine for years – Russia had no other choice", "content": "The West had been provoking this war for years. Russia faced a choice with no way out. Firstly, if it had not reacted to the Western moves in Ukraine, the West would have trumpeted its victory, speaking about Putin’s weakness and Russia’s declining power. This would have been an incentive for further actions against Russia.The Russian military operation in Ukraine ends the Western dreams about Ukrainian membership in NATO. However, it does create numerous possibilities for the West to attack Russia. Perhaps, the West has provoked Russia to realise this military intervention. "}, {"title": "Neo-Nazis commit genocide in Ukraine, Russia fights them", "content": "Nobody intends to attack the Ukrainian people. Russia is talking about preventing the neo-Nazis and those who promote methods of genocide from ruling this country. "}, {"title": "Russia doesn't attack civilians", "content": "Precision military strikes were used to take down airports, military infrastructure. The Ukrainian Army has been paralysed. The Russian military does not attack civilians."}, {"title": "Putin should receive the Nobel Peace Prize for ending the sad drama of Donbas", "content": "If the people of Donbas recognise the fact that they have become second-class citizens as a result of the 2014 coup, then they have the right to rebel. If they demand independence, I support them in this matter. At this point, I want to criticise the Minsk agreements that imposed the affiliation with the Ukrainian state on the people of Donbas despite their will. For eight long years, Donbas has faced a sad drama leading to a mass exodus of population from the region, which was one of the wealthiest parts of Ukraine ten years ago. Today, it is a place from which civilians are fleeing.The decision of President Putin to recognise the independence of the Donetsk and Lugansk People’s Republics is a chance to end this eight-year-long drama. If it happens this way, President Putin should receive the Nobel Peace Prize. "}, {"title": "Half of the Poles do not want Poland to support Ukraine", "content": "According to various polls, at least half of Polish society does not want Poland to actively support Ukraine against Russia - it is a great embarrassment that the voice of these people is not heard in public discussions. The Polish media and the politicians invited by media spread the same hysterical Russophobic gibberish. "}, {"title": "The West is lying when it claims that Russia “invaded” and “attacked” Ukraine", "content": "Some lies sold by the West: Russia is “invading”, “attacking” and “launching an offensive”. The Russian “invasion” has become a soap opera in the Western media, fed by the US government that insists that Russia started “a bloody and destructive war”. "}, {"title": "Ukraine destroyed the Minsk agreements", "content": "Ukraine has done everything to sabotage and destroy the Minsk agreements. Kyiv diligently ignored the Minsk agreements. "}, {"title": "Poroshenko and Zelenskyy have been refusing to implement the Minsk agreements", "content": "Poroshenko and Zelenskyy have long and diligently fought back from the implementation of the Minsk agreements. [...] Kyiv not only denied the implementation of the Minsk agreements but also Kyiv, using the so-called \"toad jumping\" technology, gradually captured the gray zone located between combat positions. [...] Kyiv did not want to perform \"Minsk\", and now it is possible not to perform it. But it turned out that the Minsk agreements, among other things, guaranteed the security of the Ukrainian authorities. "}, {"title": "Ukraine is a colony with a puppet regime", "content": "Ukraine has become an instrument of someone else's game against Russia, a \"colony with a puppet regime\" which also can be used as a forward springboard for an attack on Russia. "}, {"title": "Ukraine is a colony with a puppet regime, it has no right to join NATO", "content": "Ukraine became the tool of other games, a colony with a puppet regime (of Anglo-Saxons), an outpost against Russia. The statehood of Ukraine and the legitimacy of its authorities is a big question. It has no right to join NATO. "}, {"title": "Ukraine has no sustainable statehood", "content": "No sustainable statehood has ever been established in Ukraine. Modern Ukraine was created by communist Russia and the state can be named Ukraine after Vladimir Lenin. "}, {"title": "Biden doing his best to start a war between Russia and Ukraine", "content": "The US president is doing his best to start a war between Russia and Ukraine, and then between Russia and Europe. Moreover, President Biden is dragging Putin to Ukraine. "}, {"title": "Russia has never attacked anyone", "content": "Russia has never attacked anyone in its history. Russia, which has survived many wars, is the last country in Europe that wants to even utter the word war. "}, {"title": "NATO floods Ukraine with modern weapons to push Kyiv for a military solution in Donbas", "content": "NATO countries flood Ukraine with modern weapons and ammunition to push Kyiv for a military solution in Donbas. At the root of this escalation in Donbas are provocations of the Ukrainian security forces."}, {"title": "Kindergarten in East Ukraine was purposefully destroyed by a Ukrainian tank to underpin the Ukrainian negotiation position", "content": "The news that \"separatists\" had shelled a kindergarten in Stanytsia Luhanska, a locality under the control of Ukrainian forces spread like a houise fire through Western social and mass media. The pictures show a wide \"breach\" in a massive four-brick-thick wall of the building. The bricks have collapsed inside the building, crushing children's toys. The picture is meant to evoke an emotional reaction.But I would rather believe that they drove a Ukrainian tank into direct firing range and fired an armour-piercing missile without any explosives, at the kindergarten in order to get a picture of destruction.The Kyiv regime is used to underpinning its negotiating position with an escalation on the line of contact in the conflict area, just in time for important summits and other international meetings. "}, {"title": "Throughout its history, Russia has never attacked anyone", "content": "What is the point of Russia attacking anyone? We must remember that throughout its history, Russia has never attacked anyone. Russia, which has known so many wars, is the last country in Europe to even want to speak, to utter a single word of war. "}, {"title": "Moscow must interfere because Kyiv gasses people in camps", "content": "Russia cannot help stopping the war in Ukraine. It cannot wait until Kyiv starts gassing people in concentration camps. It is already going on and it will get worse. Russia cannot put up with it. "}, {"title": "Russia has nothing to do with the intra-Ukrainian conflict", "content": "Russian obligations under the 1994 Budapest Memorandum have nothing to do with the internal conflict in Ukraine. The loss of territorial integrity by the state [of Ukraine] occurred as a result of internal processes. "}, {"title": "US transfered jihadist groups in Eastern Ukraine to prepare a provocation against Russia", "content": "Aggressive American posturing lately suggests that they have the temptation to provoke a military scenario. It is not at all obvious that they intervene directly. According to Russian military intelligence, there are many jihadist groups that have landed on the front line on the Ukrainian side and it is feared that there are provocations that are being implemented. "}, {"title": "A referendum and a coup forced Luhansk and Donetsk to declare independence", "content": "On May 12, 2014, the \"Donetsk People's Republic\" and \"Luhansk People's Republic\" declared their independence after most of the residents of the eastern Ukrainian provinces of Luhansk and Donetsk voted in a referendum in favour of secession from Ukraine.The rift began to widen rapidly between Kyiv on the one hand, and Donetsk, Luhansk, and a number of other regions in eastern Ukraine on the other hand, following a coup in Kyiv in February 2014 that overthrew President Viktor Yanukovych. It originates in Donetsk, and unleashed the forces of the extreme nationalist right whose custodial base is located in the west of the country. "}, {"title": "What is happening in the Donbas today is a genocide", "content": "According to our assessment, what is happening in the Donbas today is genocide. Moreover, human rights are massively violated in Ukraine and there is discrimination against the Russian-speaking population. "}, {"title": "The West was destroyed without a gunshot", "content": "Some Russian forces were pulled back from the Ukrainian border after their exercises ended, so the day marks the complete failure of the West's war propaganda, as Moscow is not launching an attack against Ukraine."}, {"title": "The US is interested in unleashing a war between Russia and Ukraine", "content": "An obvious goal of the United States under all presidents is to organise a war between Ukraine and the Russian Federation. Russia is a military rival, the only country in the world that can destroy the US in the event of a direct military conflict. Therefore, Russia must be weakened as much as possible, and even better: make sure that it falls apart. "}, {"title": "The US needs war between Russia and Ukraine to weaken Russia", "content": "The US wants to wage a war between Russia and Ukraine. The point is to weaken Russia. It is the American aim since 1946. Russia is a military opponent, the only country in the world which could destroy the US. Therefore, the point of the US is to weaken or even cause Russia to collapse. "}, {"title": "Just like Russiagate, Western hysteria about Ukraine is based on false information", "content": "The United States, and the West in general, thanks to their media domination, are trying to impose on the world an idea that what is happening is Russian aggression against Ukraine. Russia did absolutely nothing in Ukraine, but the hysteria in the Western press was effectively equal to Russiagate, the source of which, as we later learned, was a paid report by Hillary Clinton, based on false information from a former British intelligence officer, Christopher Steele. "}, {"title": "There is no evidence that Russian is planning an invasion of Ukraine", "content": "In recent months, high-ranking Western officials and the media have been making almost daily warnings that Russia is planning an invasion of Ukraine, but no actual evidence to back up these claims has ever emerged. "}, {"title": "Russia only supports the legitimate rights of the Donbas people", "content": "Russia does not threaten anyone, and it does not intend to attack Ukraine or threaten any of its neighbours in any way. All that Russia wants is to preserve the security of its lands and citizens, and to support the legitimate rights of the people of the Donbas region, including 700,000 citizens with Russian citizenship,to preserve their culture, language and belonging to the Russian world, without any infringement on Ukrainian sovereignty, and without even support for the separatist tendencies of those republics. "}, {"title": "The West continues to accuse Russia of “massing troops” near the Ukrainian border", "content": "The West continues to accuse Russia of \"amassing troops\" near the Ukrainian border and claims that Moscow intends to \"invade\" its neighbour. Russia has repeatedly stressed that the claims of “invasion” are provocations. "}, {"title": "NATO has no interest in peace in Ukraine", "content": "NATO has no interest in peace in Ukraine, and all that the West is doing is using Ukraine only to ensure the so-called containment of Russia, undermining its defence capabilities and economic development. "}, {"title": "Russian-Belarusian defensive exercises are response to US war preparation in Eastern Europe", "content": "The joint Russian-Belarusian military training “Allied Resolve 2022” is an answer to the American rotation programme “Atlantic Resolve”. Russian-Belarusian exercise is defensive and is implemented on the territory of the Union state. It is the main difference from the American “Atlantic Resolve”, which is implemented on the territory of Eastern Europe and is the preparation for possible US Army actions in Belarus or Ukraine. “Allied Resolve 2022” is an answer to an aggressive and desperate policy of the US.Meanwhile, it is Washington who is guilty of instability in Europe because the US organised in 2014 coup in Ukraine which started the civil war in Ukraine, and Crimea, as result, went back to Russia. "}, {"title": "US and UK are mainly responsilbe for escalation around Ukraine", "content": "The US and the UK are the main driving forces behind rising tensions between the collective West and Russia. Washington had apparently \"forgotten that diplomacy exists\". The US now uses \"sanctions, pressure, intimidation and ultimatums\" as its main weapons.Any attempt to divert public attention from domestic problems to a supposed \"Russian threat\" is extremely damaging to European security. In recent months, the West has repeatedly accused Russia of planning an invasion of Ukraine. Moscow always rejects these accusations. "}, {"title": "Ukraine does not want the return of Donbas because of the neo-Nazi cult of Bandera", "content": "The Ukrainian political class installed as a result of the 2014 coup is afraid of the presence of the Donbas politicians in Ukrainian politics. Indeed, the return of Donbas to Ukraine would imply the reconstruction of the Ukrainian political scene. The Ukrainian Parliament will have to take into consideration the politicians who want friendly relations with Russia and who are critical of the neo-Banderite nationalism. The Kyiv political class does not like this situation – after the return of Donbas, there will be a necessity to look for a compromise and to soften the neo-Nazi cult of Bandera. The Ukrainian Foreign Minister Kuleba announces that Kyiv is afraid of Donbas and does not want it to come back. "}, {"title": "In 2014 there was an Atlanticist coup d'état in Ukraine", "content": "In 2014 there was an Atlanticist coup d'état in Ukraine specifically aimed at eliminating any possible cooperation between the EU (primarily Germany) and Russia. "}, {"title": "There was a coup in Ukraine in 2014", "content": "There was a coup d’état in Ukraine in 2014. Since the coup d’état in 2014, Ukraine’s economy has been in decline."}, {"title": "The Minsk agreements require \"special legal status\" for Donetsk", "content": "Russia is not a party to the conflict (in the Donbas). The Ukrainian authorities are not implementing the agreements signed in the Belarusian capital, Minsk, in order to settle the conflict, especially by refusing to grant the lands of the two \"people's\" republics a special legal status. "}, {"title": "Russia is not a party to the Minsk Agreement", "content": "Since 2014, Ukraine has been witnessing an acute political-military crisis that erupted after the change of authority in Kyiv following widespread demonstrations with the support of the West and the intense participation of the nationalist forces in the country.In the Donbass region of eastern Ukraine, which is inhabited by a majority Russian-speaking population, a war broke out between local forces and the government, while the local population announced the establishment of the Donetsk and Lugansk People's Republicsin April 2014, which do not enjoy any international recognition.Russia has repeatedly stressed that it is not part of the terms of the Minsk agreements on settling this conflict, accusing the authorities in Kyiv of seeking to resolve it through military means. "}, {"title": "Washington seeks a war between Russia and Ukraine; Moscow tries to avoid it", "content": "A war with Ukraine, of course, is not a favorable scenario for Russia. On the contrary, this is what Washington seeks, and what Moscow is trying to avoid."}, {"title": "The UK, Poland and Ukraine want to create a mini-NATO based on Russophobia", "content": "It is obvious that Ukraine cannot be accepted to NATO today – not because of standards, but because of resistance of particular countries. For example, Hungary speaks about the rights of its minority in Ukraine, while Germany does not need an additional confrontation with Russia. That is why such alliances as the UK-Poland-Ukraine emerge, such a mini-NATO. What do these three countries have in common? Russophobia. "}, {"title": "Removal of YouTube accounts from LNR and DNR violates freedom of information", "content": "The recent removal by some social media platforms of accounts run by Moscow-backed territories in Eastern Ukraine is a violation of the UN-backed right for freedom of information. "}, {"title": "The West wants to turn Ukrainians against Russians", "content": "Ukrainians should not succumb to the provocations of the West which wants to turn them against the Russians. "}, {"title": "Kyiv is persistently sabotaging the Minks agreements", "content": "Kyiv is persistently sabotaging the implementation of the Minsk agreements on which the settlement in Ukraine is based. "}, {"title": "Kyiv is refusing to implement the Minsk agreements", "content": "The negotiating process has effectively stalled because Ukraine refuses to implement the political clause of the Minsk agreements.Kyiv rejects direct dialogue with the DNR and the LNR, opposes the enshrinement of the region's special status in the constitution and demands that the part of the Donbas bordering Russia be placed under Kyiv's control before the political clauses are implemented, despite the reverse logic of the Minsk agreement. "}, {"title": "The United States wants to drag Russia into an armed conflict", "content": "The primary task for the US is not [ensuring] the security of Ukraine, but the containment of Russia's development, including by drawing it into a military conflict. "}, {"title": "Anglo-Saxons and their Central European satellites seek conflict with Russia at all costs", "content": "A Polish expert claims that the current crisis with Russia allows the West to rebuild its unity. However, the opposite seems to be true. On the one hand, there is Continental Europe, led by Germany and France, which speak about the need for dialogue with Moscow, intensification of the Normandy Format and a peaceful resolution of existing contradictions. On the other hand, the Anglo-Saxon bloc (UK, US to some extent) and its Central European satellites (Poland, Lithuania, Latvia, Estonia) are blowing the trumpets of war, seeking the conflict with Russia at all costs. The leaders of other countries (Hungary, Croatia) openly declare that they will not be involved in any quarrels related to Ukraine. "}, {"title": "Ukraine will become a springboard for possible military operations against Russia", "content": "Sooner or later Ukraine will become a springboard for possible military operations against Russia. Given the length of the border, this situation is a disadvantage for Russia, which cannot be compared with the NATO membership of the Baltic countries. The military build-up in Ukraine by the United States and the West poses a fundamental threat to Russia. "}, {"title": "The US will start a war in Ukraine when NATO coalition against Russia is ready", "content": "The US could begin a big conflict in Ukraine when Washington creates a wide NATO coalition prepared for a war against Russia. Currently, the US supports slow conflict in Donbas and is strengthening its own positions near the Russian border. "}, {"title": "Russia is not involved in the conflict in Eastern Ukraine", "content": "Russia is not involved in the conflict in Eastern Ukraine. The West and Kyiv have recently created panic around the world with accusations of a possible Russian invasion of Ukraine. The Kremlin has described these allegations as \"empty and baseless\" and designed to escalate tensions, pointing out that Russia poses no threat to anyone. "}]